const languages = {
  'CN': {
    text01: '创建钱包',
    text02: '没有钱包',
    text03: '导入钱包',
    text04: '已有钱包',
    text05: '我已阅读并同意《用户协议》',
    text06: '创建钱包',
    text07: '钱包名称',
    text08: '1~10个字符',
    text09: '钱包密码',
    text10: '设置钱包密码（不少于8位）',
    text11: '重复输入确认钱包密码',
    text12: '创建（按钮文字）',
    text13: '报错提示：密码不一致！',
    text14: '备份助记词',
    text15: '备份提示',
    text16: `Hermit Wallet 不会为您保存钱包助记词，请自行备份保管。
             获得助记词即拥有资产，为确保安全，请勿截图或在线保存助记词。`,
    text17: '备份钱包',
    text18: '请按顺序备份助记词，确保备份无误。',
    text19: '已完成备份',
    text20: '验证助记词',
    text21: '请根据已备份好的助记词按顺序选择',
    text22: '确认',
    text23: '助记词错误，请重新确认！',
    text24: '钱包创建成功',
    text25: '助记词',
    text26: '由单词组成，以空格隔开',
    text27: '私钥',
    text28: '明文私钥',
    text29: 'Keystore',
    text30: '加密的私钥 JSON',
    text31: '助记词导入',
    text32: '助记词（空格隔开填入）',
    text33: '输入助记词单词，使用空格隔开',
    text34: '钱包密码',
    text35: '设置钱包密码（不少于8位）',
    text36: '重复输入确认钱包密码',
    text37: '钱包名称',
    text38: '设置钱包名称',
    text39: '导入',
    text40: '为无效助记词，请检查！',
    text41: '助记词错误，请检查！',
    text42: '前后密码不一致，请重新输入！',
    text43: '导入成功！',
    text44: '私钥导入',
    text45: '钱包密码',
    text46: '设置钱包密码（不少于8位）',
    text47: '重复输入确认钱包密码',
    text48: '钱包名称',
    text49: '设置钱包名称',
    text50: '请输入有效私钥！',
    text51: '前后密码不一致，请重新输入！',
    text52: '导入成功！',
    text53: 'Keystore导入',
    text54: '输入Keystore文件内容',
    text55: '钱包密码',
    text56: '输入Keystore原对应钱包密码',
    text57: '输入钱包名称',
    text58: '导入',
    text59: '不正确的Keystore内容，请检查！',
    text60: 'Keystore原对应钱包密码错误，请确认！',
    text61: '导入成功！',
    text62: '选择导入类型',
    text63: 'Keystore 不能为空',
    text64: '钱包密码不能为空',
    text65: '钱包名称不能为空',
    text66: '创建您自己的钱包',
    text67: '保护您的资产',
    text68: '用户协议',
    text69: '获得助记词等于拥有钱包资产所有权',
    text70: '下一步',
    text71: '请勿截图',
    text72: '输入明文私钥',
    text73: '请按顺序抄写助记词，确保备份正确。',
    text74: '妥善保管助记词至隔离网络的安全地方。',
    text75: '请勿将助记词在联网环境下分享和存储，比如邮件、相册、社交应用等。  ',
    text76: '设置钱包名称',
    text77: '助记词由英文单词组成，请抄写并妥善保管。',
    text78: '助记词丢失，无法找回，请务必备份助记词。',
    text79: '钱包密码不能为空！',
    text80: '密码长度不能少于8位',
    text81: '私钥不能为空',
    text82: '导入',
    text83: '输入Keystore原对应资金密码',
    text84: '密码输入不一致，请重新输入',
    text85: '钱包名称不能超过10个字符',
    text86: '钱包已存在，请勿导入相同的钱包',
    text87: `ㅤㅤHermit Matrix Network（以下简称我或者我们）是专业从事区块链软件的极客开发组织，专注于利用去中心化技术为像您这样的个人（“您”或“您的”）提供可信的数字资产管理服务。我们托管一个顶级域名站：https://www.hermit.network，该网站提供有关Hermit和我们的产品的信息，以及我们产品的子域（“网站”）信息，其中包括文本、图像、音频、代码和其他材料或第三方信息。<br>
    
    由于越来越多的诈骗者想方设法欺骗毫无戒心的受害者的数字资产，请您在每次访问我们的域名站时验证SSL证书。在从您正在访问的网站下载、点击或以其他方式与之交互之前，请确保SSL证书的真实性。为免疑义，我们无法控制任何第三方网站或服务的内容、隐私政策或行为，也不对其承担任何责任。对于因使用或依赖任何此类网站或服务上或通过此类网站或服务提供的任何此类内容、商品或服务而造成或声称造成的任何损害或损失，我们概不负责或承担任何直接或间接责任。<br>
    
    本《服务协议》（“协议”或“服务协议”）包含管理您访问和使用我们提供的网站和服务（定义如下）的条款和条件，并且是我们与您或您所代表的实体之间的协议。在使用本网站或服务之前，请仔细阅读本《服务协议》。通过使用本网站，或单击按钮或复选框以接受或同意本《服务协议》的服务条款（如有该选项），或者填写服务订单，或者，如果更早，使用或以其他方式访问服务（“生效日期”），您(1)接受并同意本《服务协议》以及我们不时发布的任何附加条款、规则和参与条件，以及(2)同意如我们的《隐私政策》中所述的收集、使用、披露和其他处理信息的活动。如果您不同意本《服务协议》，则您不得访问或使用服务。<br>
    
    我们在此特别提醒您在使用我们的Hermit移动应用（以下简称“Hermit”或“本软件”， Hermit可在各移动应用平台上下载，包括但不限于Google Play Store和Apple App Store）之前，请认真阅读本《服务协议》及本《服务协议》中提及的其他文件，尤其是本《服务协议》中“免责及责任限制”条款，确保您充分理解本《服务协议》中各条款，并自主考虑使用Hermit的风险。<br>
    
    一、关于本《服务协议》的确认与接纳<br>
    1.您理解本《服务协议》及有关协议适用于Hermit及Hermit上我们所自主开发和拥有的去中心化应用（简称“DApp”）（排除第三方开发的DApp）。<br>
    2.您下载Hermit软件并创建身份、恢复身份（定义见下文）或导入钱包，即视为您已经充分阅读并接受本《服务协议》全部条款，本《服务协议》立即生效，对双方具有约束力。如果您不同意本《服务协议》条款，您必须立即停止使用Hermit。如果您已经下载了Hermit，请立即删除。<br>
    3.在访问或使用Hermit时, 您同意：<br>
    （1）接受本《服务协议》最新版本的约束（不变更亦不修改）；<br>
    （2）在您所适用的司法管辖区域内，您已达到使用Hermit的法定年龄，并可承担因使用Hermit而产生的有约束力法律或金钱义务；<br>
    （3）您不属于被排除人士（如下文所定义）。<br>
    4.本《服务协议》可由我们随时更新，经修改的《服务协议》一经在我们的网站上公布，立即自动生效，不再另行通知。在我们公布修改协议条款后，如果您不接受修改后的条款，请立即停止使用Hermit。<br>
    5.提请您关注，您在对本《服务条款》进行任何此类修改后使用Hermit即表示您接受这些修改后的《服务条款》。<br>
    二、定义<br>
    1.中国：指中华人民共和国，包含(1)香港特别行政区、(2)澳门特别行政区和(3)台湾地区。<br>
    2. Hermit：指由我们基于分布式账本技术开发的多币种数字钱包，包括其他为方便您使用区块链系统而开发的辅助工具。<br>
    3.被排除人士：<br>
    （1）除了自然人以外的、具备订立本《服务协议》的法律和意识能力的人士；或<br>
    （2）因本《服务协议》、法律、监管要求或适用于该用户的司法管辖区的规定而被以任何形式或方式（全部或部分）禁止、限制、无授权或无资格使用服务（如本《服务协议》所定义）的人。<br>
    （3）为免疑义，居住在中国境内的居民和/或定居在中国境内的用户亦涵盖在“被排除人士”的定义内。<br>
    我们不向被排除人士提供服务。如果您是被排除人士，请立即停止使用我们的服务。如果您继续使用我们的服务，您承认并同意您将根据您居住的司法管辖区的适用法律、法规和规定承担所有相应的责任，并且您应使得我们免于承担因您的此类使用行为而引起的任何责任，包括但不限于因此类违反、违约、违法而对我们造成的损失、第三方索赔或行政处罚，以及合理的法律和行政成本、费用和开支，包括合理的律师费在内。<br>
    
    4.身份：指基于您的公私钥对生成的数字识别身份。<br>
    5.新手指南：指在您使用Hermit之前（及在将来的使用过程中），我们为您提供的Hermit操作指南，以帮助您了解区块链的基础知识。<br>
    6.创建或导入钱包：指在您接受本《服务协议》后，使用Hermit创建或导入钱包的过程。<br>
    7.钱包密码：指您在创建Hermit钱包过程中，由您决定的密码，该密码将被用于加密和保护您的私钥。Hermit作为去中心化的应用，钱包密码不存储在您的这台移动设备或我们的服务器，一旦您丢失或忘记钱包密码，您需要借助私钥或助记词重置钱包密码。<br>
    8.信息提示：Hermit软件操作界面涉及的信息提示内容，建议您按照相关步骤进行操作。<br>
    9.特定用户：指按照新加坡和其他国家的法律法规及政策规定必须要配合我们履行个人信息披露义务的用户。<br>
    10.开发者用户：指按照我们的通知及相关开源协议规定使用Hermit开源代码和开发者模式等针对开发者提供的服务的用户。<br>
    11.私钥：由256位随机字符构成，是用户拥有并使用数字代币的核心。<br>
    12.公钥：由私钥借助密码学原理单向推导生成，并用以生成区块链数字钱包地址，数字钱包地址即为公开收款地址。<br>
    13.助记词：符合区块链BIP39行业标准，由随机算法生成的12（或15/18/21/24）个有序单词组成。是私钥的易记录表现形式，方便您备份保管。<br>
    14.Keystore: 是私钥或助记词经过您设置的钱包密码加密保存的文件形式，它只存储在您的这台移动设备中，不会同步至我们的服务器。<br>
    15.数字代币：指Hermit目前支持的数字代币种类，包括但不限于BTC、ETH等。<br>
    16.资料：指Hermit上“浏览”、“市场”等版块的文章等资料，这些资料均为第三方所有，未经授权不得转载。这些资料仅供您参考，并不构成我们对您交易的指导或建议。<br>
    17.消息中心：指您可以接收我们发出的信息或通知的收件箱。<br>
    18.个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别用户个人身份的各种信息，包括但不限于个人生物识别信息、邮件地址、钱包地址、移动设备信息、操作记录、交易记录等，但不包括用户的钱包密码、私钥、助记词、Keystore。<br>
    19.智能合约：指一种旨在以信息化方式传播、验证或执行合同的、基于以太坊的智能化合约，包括但不限于后文提及Tokenlon智能合约。<br>
    20.WETH：指以太币代币化，因为以太币不符合自己的ERC20标准，包装以太币代币化，方便以太币直接与其他代币交易。Hermit所支持代币与WETH的兑换比率由第三方智能合约决定。<br>
    21.ETH：指以太币，是与以太坊区块链相关的加密数字代币，为避免疑问，其不包括“以太坊经典”。<br>
    22. Hermit开源代码（“Hermit OSC”）：指我们公开宣布开源的部分Hermit软件代码，允许开发者用户在遵循相关开源协议及我们通知的规定下使用（包括二次开发）该部分开源代码。<br>
    23.开源协议：指开发者用户使用Hermit开源代码所应遵循的第三方开源协议。<br>
    24.第三方服务：指第三方DApp、第三方智能合约、第三方开源协议、第三方硬件钱包、第三方网页、第三方交易所等第三方提供的产品和服务。<br>
    三、Hermit服务（统称“服务”）<br>
    1.创建和恢复身份。您可以使用Hermit提供的“创建身份”、“恢复身份”按键进行身份的创建和恢复，并能在一个身份下，同时管理多链钱包。<br>
    2.导入钱包。对Hermit支持的数字代币，您可以使用Hermit生成新钱包或导入相关区块链系统的其它钱包工具生成的兼容钱包。<br>
    3.转账、收款。您可以使用Hermit的转账、收款功能进行数字代币的管理，即运用私钥进行电子签名，对相关区块链的账本进行修改。转账是指付款方利用收款方的ENS域名或区块链地址进行转账操作，该“转账”行为涉及在相关区块链系统的分布式账本中对该交易的有效记录（而非在Hermit上实际交付或转让数字代币）。<br>
    4.行情查看。您可以使用Hermit查看第三方提供的数字代币汇率价格。Hermit通过抓取相应的数字代币汇率信息并展示在Hermit中的“市场”版块。<br>
    5.管理数字代币。您可以从Hermit操作界面添加、保管或移除Hermit所支持的数字代币（ETH、BTC除外）。<br>
    6.币币兑换（DEX）。您可以与使用第三方Hermit智能合约的第三方进行数字代币兑换，由Hermit作为界面工具帮助您和第三方智能合约交互并显示该数字代币兑换的相应结果。<br>
    7.浏览DApp。您通过Hermit访问并使用该DApp（包括我们自己的DApp和第三方DApp）提供的服务。<br>
    8.搜索DApp。您通过Hermit的搜索框，可以对已在Hermit罗列的DApp进行搜索。<br>
    9.集成硬件钱包。您可以使用合适版本的Hermit与特定的硬件钱包进行匹配，并利用硬件钱包确认通过Hermit所进行的交易。<br>
    10.免密支付。您可以使用Hermit中的免密支付功能，免密支付将用户钱包密码通过安全加密算法存储至您的手机设备的Keychain/Keystore中，交易时调用您的生物识别（指纹或面容）鉴权，快速完成支付与签名。<br>
    11.开发者模式。为方便开发者用户，在开发者模式下开发者用户可以通过搜索框键入URL而访问任何其他网站和未在Hermit集成的第三方DApp。<br>
    12.交易记录。我们将通过区块链系统拷贝您全部或部分的交易记录。但您应以区块链系统的最新交易记录为准。<br>
    13.暂停服务。您知悉，基于区块链系统交易“不可撤销”的属性，我们不能为您撤回或撤销交易操作，但在一定情况下，我们可以暂停或者限制某位用户对Hermit软件的操作。<br>
    14.其他我们认为有必要提供的服务。<br>
    用户使用Hermit时了解并接受：<br>
    1.秉承着区块链的去中心化特点，并为了保护您数字代币安全，我们提供的是去中心化服务，大大区别于银行业金融机构。您了解并接受，我们不承担以下责任：<br>
    （1）存储您的钱包密码（即您创建/导入钱包时设置的密码）、私钥、助记词或Keystore；<br>
    （2）找回您的钱包密码、私钥、助记词或Keystore；<br>
    （3）冻结钱包；<br>
    （4）挂失钱包；<br>
    （5）恢复钱包；或<br>
    （6）交易回滚。<br>
    2.您应当自行承担保管含有Hermit的移动设备、备份Hermit、备份钱包密码、助记词、私钥及Keystore的责任。如您遗失移动设备、删除且未备份Hermit、删除且未备份钱包、钱包被盗或遗忘钱包密码、私钥、助记词或Keystore，我们均无法还原钱包或找回钱包密码、私钥、助记词或Keystore；如用户进行交易时误操作（例如输错转账地址、输错兑换数额），我们无法取消交易，且我们亦不应对此承担任何责任。<br>
    3.如您使用Hermit的免密支付功能，请您妥善备份钱包密码。当您的指纹或面容识别多次验证失败之后，您将需要输入自己的钱包密码。如果您遗忘钱包密码的，您需要通过导入助记词/私钥的方式，设置新的钱包密码。我们不存储您的指纹、面容识别等生物信息，且我们亦不应对此承担任何责任。<br>
    4. Hermit所能够提供的数字代币管理服务并未包括所有已存在的数字代币，请勿通过Hermit操作任何Hermit不支持的数字代币。<br>
    5. Hermit上集成的DApp包括我们自主拥有的DApp和第三方平台提供的DApp。对于第三方平台提供的DApp，Hermit仅为用户进入DApp提供搜索和区块链浏览器功能，不对第三方DApp的功能或服务质量提供任何担保。您在第三方DApp上接受服务或进行交易前应自行判断和评估该第三方DApp提供的服务或交易是否存在风险。<br>
    6. Hermit上提供的币币兑换功能的实质是您使用第三方智能合约在区块链系统上进行的数字代币兑换。对于第三方智能合约提供的服务，Hermit仅为您提供与第三方智能合约交互的工具，不对第三方智能合约的功能或服务质量提供任何担保。您在该第三方智能合约上接受服务或进行交易前应自行判断和评估该第三方智能合约提供的服务或交易是否存在风险。我们强烈建议您阅读相关智能合约的不断更新的用户协议和/或免责声明。我们保留出于任何原因立即终止或暂停访问这些第三方服务的权利，恕不另行通知或承担责任。<br>
    7. Hermit上集成的硬件钱包由第三方提供，Hermit不对第三方硬件钱包的功能或服务质量提供任何担保，且Hermit不保证实现与任何种类和版本的硬件钱包之间的匹配功能（具体请以我们不时作出的通知为准）。用户在使用第三方硬件钱包之前应自行判断和评估该硬件钱包是否存在风险。您应仔细阅读并同意相关硬件钱包的不断更新的使用许可协议等文件。<br>
    8.您在Hermit上使用开发者模式通过输入URL访问其他网站或未在Hermit集成的第三方DApps的，您知悉并同意您了解URL链接的网站和第三方DApps可能存在的安全隐患，并独立承担所有的风险和后果。<br>
    四、您的权利义务<br>
    （一）创建或导入钱包<br>
    1.创建或导入钱包。您有权在您的移动设备上通过Hermit创建和/或导入钱包，有权设定钱包的钱包密码等信息，并有权通过Hermit应用程序，使用自己的钱包在区块链上进行转账和收款等交易。<br>
    2.身份验证。按照有关法律法规的要求，特定用户在使用Hermit提供的有关服务时，应当按照Hermit的提示及时完成相关身份验证，要求您提交包括但不限于您的姓名、身份证号码、手机号码、银行卡号信息等个人信息。否则该特定用户将无法使用有关服务，因特定用户拖延造成的损失由您自行承担。<br>
    3.我们可能为不同的终端设备开发不同的软件版本，您应当根据实际需要选择下载合适的版本进行安装。如果您从未经合法授权的第三方获取本软件或与本软件名称相同的安装程序，我们将无法保证该软件能否正常使用，也无法保证其安全性，因此造成的损失由您自行承担。<br>
    4.本软件新版本发布后，旧版软件可能无法使用。我们不保证旧版软件的安全性、继续可用性及提供相应的客户服务。请您随时核对并下载最新版本。<br>
    （二）使用Hermit<br>
    1.您应自行承担妥善保管移动设备、钱包密码、私钥、助记词和Keystore等信息的责任。我们不负责为您保管以上信息。因您遗失移动设备或硬件钱包、主动或被动泄露、遗忘钱包密码、私钥、助记词、Keystore或遭受他人攻击、诈骗等所引起的一切风险、责任、损失、费用应由您自行承担。<br>
    2. Hermit信息提示。您了解并同意遵循我们在Hermit上发布的信息提示，按照信息提示的内容进行操作，否则，由此引起的一切风险、责任、损失、费用等应由您自行承担。<br>
    3.您知悉并理解Hermit没有义务对第三方服务履行尽职调查义务，您应当谨慎评估并承担所有与使用Hermit有关的风险。<br>
    4.提供信息和文件。如果我们自行认为有必要获取用户的相关信息以遵循任何与使用或操作Hermit相关的适用法律或法规的规定，您应按照我们的要求及时向我们提供该等信息，且您了解并接受，我们可以限制、暂停或终止您使用Hermit直到您提供满足我们要求的信息。您承诺及时向我们告知任何有关其依据本《服务协议》向我们提供的文件和信息中的任何变化，且在没有通知任何变化的书面通知的情形下，我们有权认为由您提供的文件和信息的内容是真实、正确、没有误导信息且没有发生改变的。<br>
    5.完成身份验证。当我们合理认为您的交易行为或交易情况出现异常的，或认为您的身份信息存在疑点的，或我们认为应核对您身份证件或其他必要文件的情形时，请您积极配合我们核对您的有效身份证件或其他必要文件，及时完成相关的身份验证。<br>
    6.转账。<br>
    （1）您知悉对于Hermit服务中您可使用的日计转账限额和笔数，可能因为您使用该转账服务时所处的国家/地区、监管要求、转账目的、Hermit风险控制、身份验证等事由而不同。<br>
    （2）您理解基于区块链操作的“不可撤销”属性，当您使用Hermit转账功能时，您应当自行承担因您操作失误而导致的后果（包括但不限于因您输错转账地址、您自身选择转账节点服务器的问题）。<br>
    （3）您知悉在使用Hermit服务时，以下情况的出现可能导致转账功能不可用、转账“交易失败”或“打包超时”：<br>
    a)钱包余额不足；<br>
    b)交易矿工费不足；<br>
    c)区块链执行智能合约代码失败；<br>
    d)超出监管部门、Hermit或法律法规规定的付款额度；<br>
    e)网络、设备等技术故障；<br>
    f)区块链网络拥堵、故障等原因引起交易被抛弃；<br>
    g)您的地址或交易对方地址被识别为特殊地址，如高风险地址。<br>
    （4）您知悉Hermit仅向您提供转账工具，在您使用Hermit完成转账后，我们即完成了当次服务的所有义务，我们对其他相关纠纷争议，不承担任何责任。<br>
    7.币币兑换。您知悉，币币兑换的每日限额目前由第三方智能合约限定。我们亦可能对您每日可币币兑换的额度进行限制并不时调整。<br>
    8.合法合规。您知悉在Hermit进行操作时或利用Hermit上的DApp、智能合约进行交易时，您应当遵循有关法律法规、国家政策的要求。<br>
    9.公告通知。Hermit会以网站公告、消息中心信息、弹窗提示或客户端通知等方式向您发送通知，例如通知您交易进展情况，或者提示您进行相关操作，请您及时予以关注。<br>
    10.服务费用与纳税义务：<br>
    （1）您使用Hermit的币币兑换服务时，第三方智能合约会向您收取手续费和/或服务费，具体费用以第三方智能合约收取数额为准，Hermit信息提示仅供参考；<br>
    （2）我们暂时不向您收取任何形式的服务费或手续费，将来需对某些服务进行收费时我们将另行约定或公布规则；<br>
    （3）您使用Hermit进行转账时应支付“矿工费”或网络费，金额由您自行决定，并由相关区块链网络收取；<br>
    （4）您知悉，在特定情况（包括但不限于您在转账期间为转账支付的“矿工费”或网络费不足，或相关区块链网络不稳定）下，您的转账操作可能失败；在该等情况下，即便您的转账操作未完成，您亦会被相关区块链网络收取矿工费；<br>
    （5）您因在Hermit进行交易而发生的所有应纳税负及其它方面的费用均由您负责支付。<br>
    （三）开发者用户基于Hermit开源代码的开发<br>
    1.开发者用户有权使用我们在官方渠道公布的Hermit开源代码进行应用程序的二次开发，并下载和使用我们针对Hermit开源代码发布的任何补丁或漏洞解决方案。<br>
    2.在使用Hermit开源代码时，开发者用户知悉并同意：<br>
    （1）如开发者用户在使用Hermit开源代码过程中发现任何漏洞、缺陷或软件改进方案的，应及时联系并告知我们，同时停止任何具有危害性的使用行为（如适用）；<br>
    （2）Hermit开源代码中可能包含第三方开源协议和源代码，我们不对该等第三方开源协议和源代码的功能、无病毒危害、无漏洞等提供任何形式的担保。开发者用户在使用Hermit开源代码时应自行判断和评估使用后果。开发者用户应仔细阅读并遵循相关开源软件协议（及我们不时作出的通知的要求。<br>
    五、风险提示<br>
    1.您了解并知悉，由于数字代币领域的法律法规政策尚未健全，该领域的数字代币可能会产生无法兑现、技术不稳定等重大风险。您也了解数字代币的价格波动幅度远高于其他金融资产。我们谨慎提醒您应当根据自身财务状况和风险偏好，以合理的方式选择持有或处置任何一种数字代币。您也了解Hermit提供的行情查看功能仅系抓取部分交易所的数字代币汇率信息的搜索结果，并不表示为最新行情或最佳报价。<br>
    2.在使用Hermit服务时，若您或您的相对方未遵从本《服务协议》或相关网站说明、交易、支付页面中之操作提示、规则，我们并不保证交易会顺利完成，且我们不承担损害赔偿责任。若发生前述情形，而款项已先行入账您的或您的交易方的Hermit钱包或第三方钱包，您理解区块链操作具有的“不可逆”属性，以及相关交易具有“不可撤销”的特征，由您及您的相对方自行承担相应的风险后果。<br>
    3.您理解并知悉，币币兑换交易均在第三方智能合约上发生、进行并完成。Hermit仅作为界面工具帮助您和第三方智能合约交互并显示该已完成交易的相应结果。<br>
    4.在您通过Hermit使用第三方服务时，我们强烈建议您仔细阅读该等第三方服务的服务协议、隐私政策和其他相关的文件和信息等，了解交易对象及产品信息，谨慎评估风险后再在该第三方上进行交易。您理解该交易和有约束力的合同关系在您和您的相对方之间建立，与我们无关。我们对因您的交易行为所引起的一切风险、责任、损失、费用不承担任何责任。<br>
    5.当您将数字代币转给其他钱包地址时，您在交易过程中应当自行判断对方是否为完全民事行为能力人并自行决定是否与对方进行交易或转账给对方等。<br>
    6.在转账过程中，如果出现“交易失败”、“打包超时”等类似的异常信息提示时，您应通过相关区块链系统的官方途径或其他的区块链查询工具进行再次确认，以避免重复转账；否则，由此所引起的一切损失和费用应由您自行承担。<br>
    7.您理解当您在Hermit上创建或导入钱包之后，您的Keystore、私钥、助记词等信息仅存储在当前的这台移动设备中，不存储在Hermit或我们的服务器上。您可以按照Hermit提供的操作指南采取同步钱包等方式更换移动设备。但若您未保存或备份钱包密码、私钥、助记词、Keystore等信息且在您移动设备丢失的情况下，您的数字代币将因此丢失，我们无法为您找回。若您在导出、保存或备份钱包密码、私钥、助记词、Keystore等信息的时候泄密，或保存或备份上述信息的设备或服务器被黑客攻击或控制等情况下，您的数字代币将因此丢失，我们无法为您找回。因前述情形产生的任何及所有损失应由您自行承担。<br>
    8.我们建议您在创建或导入钱包时对您钱包的钱包密码、私钥、助记词及Keystore等信息做好安全备份。我们提请您注意，请不要采用以下电子备份方式：截图、邮件、手机中的记事本应用、短信、微信、QQ等电子备份方式。我们建议您在纸质记事本上抄写助记词和Keystore等信息，同时您亦可将电子数据保管至密码管理器。<br>
    9.我们建议您在选购硬件钱包时应：<br>
    （1）确认您购买的硬件钱包是否与Hermit版本相匹配；<br>
    （2）从官方渠道选购全新的硬件钱包。<br>
    10.我们善意提醒您谨慎使用Hermit的免密支付功能，建议您在使用前应：<br>
    （1）仔细了解您手机设备生物识别的安全等级；<br>
    （2）请勿在公共手机中开启免密支付功能；及<br>
    （3）如果钱包中的数字资产较大，请勿开启免密支付功能。<br>
    11.我们建议您在安全的网络环境中使用Hermit，确保您的移动设备没有越狱或root， 以避免可能存在的安全隐患。<br>
    12.请您在使用Hermit过程中，警惕诈骗行为。一旦发现任何可疑行为，我们鼓励您第一时间告知我们。<br>
    六、服务的变更、中断、终止<br>
    1.您了解并同意我们可以自行决定暂时提供部分服务功能，或于将来暂停部分服务功能或开通新的服务功能。当我们改变服务时，只要您仍然使用Hermit，表示您仍然同意本《服务协议》或者本《服务协议》修正后的条款。<br>
    2.为了尽可能避免任何对Hermit的误操作或数字代币的任何安全风险，您应避免在不具备区块链基础知识的前提下使用Hermit。对不具备区块链基础知识的用户，我们有权拒绝提供部分或全部的服务功能。<br>
    3.您理解存在如下情形时，我们将暂停提供服务（或在发生如下情形时彻底终止服务）：<br>
    （1）因设备、区块链系统维修、升级、故障和通信中断等技术原因而中断Hermit的运营；<br>
    （2）因台风、地震、海啸、洪水、停电、战争或恐怖袭击等不可抗力因素，电脑病毒、木马、黑客攻击、系统不稳定或政府行为等原因，造成我们不能提供服务或我们合理认为继续提供服务会有较大风险的；<br>
    （3）适用法律或政策发生重大不利变化的；或<br>
    （4）发生我们无法控制或合理预见的其他情形。<br>
    4.当用户出现如下情况时，我们可单方面中止或终止您使用Hermit的部分或全部功能:<br>
    （1）用户死亡；<br>
    （2）盗用他人的钱包信息或移动设备；<br>
    （3）在Hermit填写虚假个人信息；<br>
    （4）拒绝Hermit的强制更新操作；<br>
    （5）违反第三方开源协议或我们通知的规定使用Hermit开源代码；<br>
    （6）将Hermit用于违法或犯罪活动；<br>
    （7）妨碍其他用户正常使用Hermit；<br>
    （8）伪称我们的工作人员或管理人员；<br>
    （9）攻击、侵入、更改或以任何其他方式威胁我们计算机系统的正常运作；<br>（10）利用Hermit宣传垃圾广告；<br>
    （11）散布谣言，损害我们和Hermit商誉；或<br>
    （12）违法行为，其他违反本《服务协议》的行为，及我们合理认为应当暂停功能的情形。<br>
    5.如果我们变更、中断、终止服务时，您有权在合理时间内导出您钱包等信息。<br>
    七、您的陈述与保证<br>
    1.您应遵守您所居住的国家或地区的法律法规，不得将Hermit用于任何非法目的，也不得以任何非法方式使用Hermit。<br>
    2.您不属于无资格使用Hermit服务的被排除人士。<br>
    3.您不得利用Hermit从事任何违法或犯罪的行为，包括但不限于：<br>
    （1）危害您所居住的国家或地区的国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一；<br>
    （2）从事任何违法犯罪行为，包括但不限于洗钱、非法集资等；<br>
    （3）通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或类似工具等，接入我们的服务、收集或处理我们所提供的内容，干预或试图干预任何用户；<br>
    （4）提供赌博资讯或以任何方式引诱他人参与赌博；<br>
    （5）侵入他人Hermit钱包盗取数字代币；<br>
    （6）进行与交易对方宣称的交易内容不符的交易，或不真实的交易；<br>
    （7）从事任何侵害或可能侵害Hermit服务系统、数据的行为；<br>
    （8）其他我们有正当理由认为不适当的行为。<br>
    4.您理解并同意，您将对您违反有关法律（包括但不限于海关及/或税务方面的监管规定）或者本《服务协议》之规定的行为负责，并应对因此类违反、违约、违法而使我们遭受任何的损失、第三方索赔或行政处罚进行赔偿，包括合理的法律和行政成本、费用和支出，以及合理的律师费用。<br>
    5.您承诺按时缴纳我们的服务费用（如有），否则我们有权暂停对您提供的服务。
    八、隐私政策<br>
    1.您提供给我们的任何数据或信息亦受我们隐私政策（“《Hermit隐私政策》”的约束，该隐私政策亦是本《服务协议》的一部分。<br>
    九、免责及责任限制<br>
    1.我们仅对本《服务协议》中所列明的义务承担责任。<br>
    2.您理解和同意，在法律所允许的最大范围内，我们只能按照现有的技术水平和条件提供Hermit服务。因下列任何原因导致Hermit无法正常提供服务，我们不承担责任：<br>
    （1）Hermit系统停机维护或升级；<br>
    （2）因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；<br>
    （3）您的移动设备软硬件和通信线路、供电线路出现故障的；<br>
    （4）您操作不当或未通过我们授权或认可的方式使用我们服务的；<br>
    （5）因电脑病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行或政府行为等原因；<br>
    （6）非因我们的原因而引起的任何其它原因。<br>
    3.我们对以下任何情形均不承担责任：<br>
    （1）因您遗失移动设备、删除且未备份Hermit、删除且未备份钱包、遗忘且未备份钱包密码、私钥、助记词、Keystore而导致该用户的数字代币丢失；<br>
    （2）因您自行泄露钱包密码、私钥、助记词、Keystore，或借用、转让或授权他人使用自己的移动设备或Hermit钱包，或未通过我们官方渠道下载Hermit应用程序或以其他不安全的方式使用Hermit应用程序导致的您的数字代币丢失；<br>
    （3）因您误操作（包括但不限于您输错转账地址、您自身选择转账节点服务器的问题）Hermit导致的数字代币丢失；<br>
    （4）因您不理解区块链技术的知识而进行误操作导致的您的数字代币丢失；<br>
    （5）因系统滞后、区块链系统不稳定等原因导致我们拷贝用户在区块链上的交易记录发生偏差；<br>
    4.您应承担由下列情形产生或与之相关的风险和后果：<br>
    （1）您使用第三方服务操作的交易；<br>
    （2）您使用开发者模式；<br>
    （3）您使用币币兑换服务，该等风险和后果应由您、交易相对方和相关智能合约发行方承担。<br>
    5.您理解Hermit仅作为您数字代币管理的工具。我们不能控制第三方服务的质量、安全或合法性，信息的真实性或准确性，以及相对方履行其在与您签订的协议项下的各项义务的能力。您自行决定是否使用第三方服务。您理解该交易和有约束力的合同关系在您和您的相对方之间建立，与我们无关。我们提醒您在使用第三方服务前，应谨慎判断第三方服务所提供相关信息的真实性、合法性和有效性。此外，您与任何第三方交易所产生的全部风险亦应由您自行承担。<br>
    6.您知悉Hermit可能同时为您及您的交易对手方提供服务或与之有关联关系或其他利益相关的关系，您同意对我们可能存在的该等行为予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张我们在提供服务时存在法律上的瑕疵，也不因此而加重我们的责任或注意义务。<br>
    7.我们不提供以下形式的保证：<br>
    （1）我们提供的服务将符合您的全部需求；<br>
    （2）您经由我们的服务取得的任何技术、产品、服务、资讯或其他材料将符合您的期望；<br>
    （3）我们从第三方交易所抓取的数字代币市场交易行情等信息的及时性、准确性、完整性、可靠性；<br>
    （4）您在Hermit上的交易对方会及时履行其在与您达成的交易协议中的各项义务。<br>
    8.在任何情况下，我们对本《服务协议》所承担的违约赔偿责任总额不超过1）0.1个以太币的市场价值；或2）新加坡元100元，以较高的为准。<br>
    9.您理解Hermit仅作为您管理数字代币、显示交易信息的工具，我们不提供法律、税务或投资建议等服务。您应当自行向法律、税务、投资方面的专业人士寻求建议，且您在使用我们服务过程中所遭受的投资损失、数据损失等，我们概不负责。<br>
    10.您理解根据适用法律法规的要求，我们可能不时更改我们的用户准入标准，限定向特定用户等提供服务的范围和方式等。<br>
    十、其他条款<br>
    1.不得转让。在符合本《服务协议》条款的情况下，只有您（而非其他人）有权向我们主张与使用服务相关的索赔。您不得转让、交易，或试图转让、交易您对该索赔的权利。任何该等转让行为均为无效，且我们对受让方不承担任何义务或责任。<br>
    2.知识产权。Hermit系我们开发并拥有知识产权的应用程序。Hermit中显示的任何内容（包括本《服务协议》、公告、文章、视频、音频、图片、档案、资讯、资料、商标或标识）的知识产权归我们或第三方权利人所有。您仅可为持有和管理数字代币之目的使用Hermit应用程序及其中的内容。未经我们或第三方权利人的事先书面同意（或相关开源协议的允许），任何人不得擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表上述应用程序及内容（包括Hermit开源代码）。本《服务协议》不应被视为授予您任何知识产权，包括出于任何目的使用与我们或服务相关的任何信息、图片、用户界面、标识、商标、商业名称、网络域名或版权的权利。<br>
    3.非弃权。任何我们未执行本《服务协议》或未向您主张我们在本《服务协议》项下的权利、索赔或诉因的行为均不被视为放弃我们向您主张任何权利、索赔或诉因的权利。<br>
    4.完整协议：<br>
    （1）本《服务协议》由《Hermit服务协议》、《Hermit隐私政策》及我们不时公布的各项规则（包括“帮助中心”的内容）组成。<br>
    （2）除了本《服务协议》中的《Hermit服务协议》、《Hermit隐私政策》外，本《服务协议》包含我们之间关于使用Hermit和相关服务的全部协议和谅解，并取代所有先前的（口头的和书面的）协议、谅解或安排。<br>
    5.税款：<br>
    （1）使用本《服务协议》下的服务不含您在任何法域就您使用本服务所适用、产生、有关的税款（“应纳税款”）。<br>
    （2）您应负责确定任何应纳税款，并向合适的税务机关申报、代扣、收集、报告和代缴正确的应纳税款。您应自行承担因未完成或未履行您的任何与应纳税款相关的义务而产生的所有处罚、索赔、罚款、惩罚和其他责任。<br>
    （3）我们不负责确定任何应纳税款，亦不负责向合适的税务机关申报、代扣、收集、报告和代缴正确的应纳税款。<br>
    6.法律适用。本《服务协议》适用新加坡共和国法律，并应据此解释。<br>
    7.管辖权。因本《服务协议》引起的或与之相关的任何争议（包括任何有关其存在、有效性、终止的问题），双方应首先寻求和解。如果该争议在该和解程序开始后的三十(30)天内仍未解决，双方应将该争议提交至新加坡国际仲裁中心（简称“SIAC”），并通过遵循新加坡国际仲裁中心届时有效的仲裁规则（该规则被视为通过引用并入本条款），最终以仲裁的方式在新加坡予以解决。仲裁庭由一名仲裁员组成，由SIAC主席任命。仲裁语言为英语。每一方不可撤销地接受新加坡法院之非专属管辖权，以支持和协助根据本段前述内容进行的仲裁程序，包括在该程序的结果作出之前给予临时救济（如必要）。<br>
    8.《合同（第三方权利）法》。新加坡共和国的《合同（第三方权利）法》（第53B章）（可能不时被修改、修订或补充）应适用于本《服务协议》。非本《服务协议》一方的人士不得拥有本《服务协议》项下的任何权利，也无权执行本《服务协议》。<br>
    9.独立性。本《服务协议》的任何部分被任何约束本《服务协议》的立法认为无效、非法或不可执行时，其仅在该范围（且不得进一步扩展）内被视为无效、非法或不可执行。为避免疑问，本《服务协议》的剩余部分将继续有效并保持充分的效力。<br>
    10.部分无效。根据任何司法管辖区的法律，本《服务协议》任何条款被认定为非法、无效或不可执行的情形不得影响该条款依据其他司法管辖区的法律被认定为合法、有效或可执行，亦不得影响本《服务协议》其他条款的合法性、有效性或可执行性。<br>
    11.本《服务协议》译本。本《服务协议》的任何译本（如有）仅为方便您而提供，无意对本《服务协议》的英文版本进行修改。如果本《服务协议》的英文版本与非英文版本之间存在冲突，应以英文版本为准。<br>
    十一、其它<br>
    1.您应当全面了解并遵守您所在司法辖区与使用服务所有相关法律、法规及规则。<br>
    2.您在使用服务过程中，如遇到任何问题，您可以通过在Hermit提交反馈等方式联系我们。<br>
    3.所有的用户可以在Hermit中查看本《服务协议》。我们鼓励您在每次访问Hermit时都查阅本《服务协议》。<br>
    4.本《服务协议》未尽事宜，您需遵守我们不时更新的公告及相关规则。<br>
    5.本《服务协议》自2022年9月3日起生效。<br>
    <br>
    本政策未尽事宜，您需遵守本站不时更新的公告及相关规则。
    `,
    text88: '12位助记词导入',
    text89: '24位助记词导入',
    text90: '助记词长度不正确'
  },
  'CT': {
    myDelegate: '我的委托',
    verifiedBy: '驗證人',
    text01: '創建錢包',
    text02: '沒有錢包',
    text03: '導入錢包',
    text04: '已有錢包',
    text05: '我已閱讀並同意《用戶協議》',
    text06: '創建錢包',
    text07: '錢包名稱',
    text08: '1~10個字符',
    text09: '錢包密碼',
    text10: '設置錢包密碼（不少於8位）',
    text11: '重復輸入確認錢包密碼',
    text12: '創建（按鈕文字）',
    text13: '報錯提示：密碼不一致！',
    text14: '備份助記詞',
    text15: '備份提示',
    text16: `Hermit Wallet 不會為您保存錢包助記詞，請自行備份保管。
                 獲得助記詞即擁有資產，為確保安全，請勿截圖或在線保存助記詞。`,
    text17: '備份錢包',
    text18: '請按順序備份助記詞，確保備份無誤。',
    text19: '已完成備份',
    text20: '驗證助記詞',
    text21: '請根據已備份好的助記詞按順序選擇',
    text22: '確認',
    text23: '助記詞錯誤，請重新確認！',
    text24: '錢包創建成功',
    text25: '助記詞',
    text26: '由單詞組成，以空格隔開',
    text27: '私鑰',
    text28: '明文私鑰',
    text29: 'Keystore',
    text30: '加密的私鑰 JSON',
    text31: '助記詞導入',
    text32: '助記詞（空格隔開填入）',
    text33: '輸入助記詞單詞，使用空格隔開',
    text34: '錢包密碼',
    text35: '設置錢包密碼（不少於8位）',
    text36: '重復輸入確認錢包密碼',
    text37: '錢包名稱',
    text38: '設置錢包名稱',
    text39: '導入',
    text40: '為無效助記詞，請檢查！',
    text41: '助記詞錯誤，請檢查！',
    text42: '前後密碼不一致，請重新輸入！',
    text43: '導入成功！',
    text44: '私鑰導入',
    text45: '錢包密碼',
    text46: '設置錢包密碼（不少於8位）',
    text47: '重復輸入確認錢包密碼',
    text48: '錢包名稱',
    text49: '設置錢包名稱',
    text50: '請輸入有效私鑰！',
    text51: '前後密碼不一致，請重新輸入！',
    text52: '導入成功！',
    text53: 'Keystore導入',
    text54: '輸入Keystore文件內容',
    text55: '錢包密碼',
    text56: '輸入Keystore原對應錢包密碼',
    text57: '輸入錢包名稱',
    text58: '導入',
    text59: '不正確的Keystore內容，請檢查！',
    text60: 'Keystore原對應錢包密碼錯誤，請確認！',
    text61: '導入成功！',
    text62: '選擇導入類型',
    text63: 'Keystore 不能為空',
    text64: '錢包密碼不能為空',
    text65: '錢包名稱不能為空',
    text66: '創建您自己的錢包',
    text67: '保護您的資產',
    text68: '用戶協議',
    text69: '獲得助記詞等於擁有錢包資產所有權',
    text70: '下一步',
    text71: '請勿截圖',
    text72: '輸入明文私鑰',
    text73: '請按順序抄寫助記詞，確保備份正確。',
    text74: '妥善保管助記詞至隔離網絡的安全地方。',
    text75: '請勿將助記詞在聯網環境下分享和存儲，比如郵件、相冊、社交應用等。  ',
    text76: '設置錢包名稱',
    text77: '助記詞由英文單詞組成，請抄寫並妥善保管。',
    text78: '助記詞丟失，無法找回，請務必備份助記詞。',
    text79: '錢包密碼不能為空！',
    text80: '密碼長度不能少於8位',
    text81: '私鑰不能為空',
    text82: '導入',
    text83: '輸入Keystore原對應資金密碼',
    text84: '密碼輸入不一致，請重新輸入',
    text85: '錢包名稱不能超過10個字符',
    text86: '錢包已存在，請勿導入相同的錢包',
    text87: `Hermit Matrix Network（以下簡稱我或者我們）是專業從事區塊鏈軟件的極客開發組織，專註於利用去中心化技術為像您這樣的個人（「您」或「您的」）提供可信的數字資產管理服務。我們托管一個頂級域名站：https://www.hermit.network，該網站提供有關Hermit和我們的產品的信息，以及我們產品的子域（「網站」）信息，其中包括文本、圖像、音頻、代碼和其他材料或第三方信息。
    
    由於越來越多的詐騙者想方設法欺騙毫無戒心的受害者的數字資產，請您在每次訪問我們的域名站時驗證SSL證書。在從您正在訪問的網站下載、點擊或以其他方式與之交互之前，請確保SSL證書的真實性。為免疑義，我們無法控製任何第三方網站或服務的內容、隱私政策或行為，也不對其承擔任何責任。對於因使用或依賴任何此類網站或服務上或通過此類網站或服務提供的任何此類內容、商品或服務而造成或聲稱造成的任何損害或損失，我們概不負責或承擔任何直接或間接責任。
    
    本《服務協議》（「協議」或「服務協議」）包含管理您訪問和使用我們提供的網站和服務（定義如下）的條款和條件，並且是我們與您或您所代表的實體之間的協議。在使用本網站或服務之前，請仔細閱讀本《服務協議》。通過使用本網站，或單擊按鈕或復選框以接受或同意本《服務協議》的服務條款（如有該選項），或者填寫服務訂單，或者，如果更早，使用或以其他方式訪問服務（「生效日期」），您(1)接受並同意本《服務協議》以及我們不時發布的任何附加條款、規則和參與條件，以及(2)同意如我們的《隱私政策》中所述的收集、使用、披露和其他處理信息的活動。如果您不同意本《服務協議》，則您不得訪問或使用服務。
    
    我們在此特別提醒您在使用我們的Hermit移動應用（以下簡稱「Hermit」或「本軟件」， Hermit可在各移動應用平臺上下載，包括但不限於Google Play Store和Apple App Store）之前，請認真閱讀本《服務協議》及本《服務協議》中提及的其他文件，尤其是本《服務協議》中「免責及責任限製」條款，確保您充分理解本《服務協議》中各條款，並自主考慮使用Hermit的風險。
    
    一、關於本《服務協議》的確認與接納
    1.您理解本《服務協議》及有關協議適用於Hermit及Hermit上我們所自主開發和擁有的去中心化應用（簡稱「DApp」）（排除第三方開發的DApp）。
    2.您下載Hermit軟件並創建身份、恢復身份（定義見下文）或導入錢包，即視為您已經充分閱讀並接受本《服務協議》全部條款，本《服務協議》立即生效，對雙方具有約束力。如果您不同意本《服務協議》條款，您必須立即停止使用Hermit。如果您已經下載了Hermit，請立即刪除。
    3.在訪問或使用Hermit時, 您同意：
    （1）接受本《服務協議》最新版本的約束（不變更亦不修改）；
    （2）在您所適用的司法管轄區域內，您已達到使用Hermit的法定年齡，並可承擔因使用Hermit而產生的有約束力法律或金錢義務；
    （3）您不屬於被排除人士（如下文所定義）。
    4.本《服務協議》可由我們隨時更新，經修改的《服務協議》一經在我們的網站上公布，立即自動生效，不再另行通知。在我們公布修改協議條款後，如果您不接受修改後的條款，請立即停止使用Hermit。
    5.提請您關註，您在對本《服務條款》進行任何此類修改後使用Hermit即表示您接受這些修改後的《服務條款》。
    二、定義
    1.中國：指中華人民共和國，包含(1)香港特別行政區、(2)澳門特別行政區和(3)臺灣地區。
    2. Hermit：指由我們基於分布式賬本技術開發的多幣種數字錢包，包括其他為方便您使用區塊鏈系統而開發的輔助工具。
    3.被排除人士：
    （1）除了自然人以外的、具備訂立本《服務協議》的法律和意識能力的人士；或
    （2）因本《服務協議》、法律、監管要求或適用於該用戶的司法管轄區的規定而被以任何形式或方式（全部或部分）禁止、限製、無授權或無資格使用服務（如本《服務協議》所定義）的人。
    （3）為免疑義，居住在中國境內的居民和/或定居在中國境內的用戶亦涵蓋在「被排除人士」的定義內。
    我們不向被排除人士提供服務。如果您是被排除人士，請立即停止使用我們的服務。如果您繼續使用我們的服務，您承認並同意您將根據您居住的司法管轄區的適用法律、法規和規定承擔所有相應的責任，並且您應使得我們免於承擔因您的此類使用行為而引起的任何責任，包括但不限於因此類違反、違約、違法而對我們造成的損失、第三方索賠或行政處罰，以及合理的法律和行政成本、費用和開支，包括合理的律師費在內。
    
    4.身份：指基於您的公私鑰對生成的數字識別身份。
    5.新手指南：指在您使用Hermit之前（及在將來的使用過程中），我們為您提供的Hermit操作指南，以幫助您了解區塊鏈的基礎知識。
    6.創建或導入錢包：指在您接受本《服務協議》後，使用Hermit創建或導入錢包的過程。
    7.錢包密碼：指您在創建Hermit錢包過程中，由您決定的密碼，該密碼將被用於加密和保護您的私鑰。Hermit作為去中心化的應用，錢包密碼不存儲在您的這臺移動設備或我們的服務器，一旦您丟失或忘記錢包密碼，您需要借助私鑰或助記詞重置錢包密碼。
    8.信息提示：Hermit軟件操作界面涉及的信息提示內容，建議您按照相關步驟進行操作。
    9.特定用戶：指按照新加坡和其他國家的法律法規及政策規定必須要配合我們履行個人信息披露義務的用戶。
    10.開發者用戶：指按照我們的通知及相關開源協議規定使用Hermit開源代碼和開發者模式等針對開發者提供的服務的用戶。
    11.私鑰：由256位隨機字符構成，是用戶擁有並使用數字代幣的核心。
    12.公鑰：由私鑰借助密碼學原理單向推導生成，並用以生成區塊鏈數字錢包地址，數字錢包地址即為公開收款地址。
    13.助記詞：符合區塊鏈BIP39行業標準，由隨機算法生成的12（或15/18/21/24）個有序單詞組成。是私鑰的易記錄表現形式，方便您備份保管。
    14.Keystore: 是私鑰或助記詞經過您設置的錢包密碼加密保存的文件形式，它只存儲在您的這臺移動設備中，不會同步至我們的服務器。
    15.數字代幣：指Hermit目前支持的數字代幣種類，包括但不限於BTC、ETH等。
    16.資料：指Hermit上「瀏覽」、「市場」等版塊的文章等資料，這些資料均為第三方所有，未經授權不得轉載。這些資料僅供您參考，並不構成我們對您交易的指導或建議。
    17.消息中心：指您可以接收我們發出的信息或通知的收件箱。
    18.個人信息：指以電子或者其他方式記錄的能夠單獨或者與其他信息結合識別用戶個人身份的各種信息，包括但不限於個人生物識別信息、郵件地址、錢包地址、移動設備信息、操作記錄、交易記錄等，但不包括用戶的錢包密碼、私鑰、助記詞、Keystore。
    19.智能合約：指一種旨在以信息化方式傳播、驗證或執行合同的、基於以太坊的智能化合約，包括但不限於後文提及Tokenlon智能合約。
    20.WETH：指以太幣代幣化，因為以太幣不符合自己的ERC20標準，包裝以太幣代幣化，方便以太幣直接與其他代幣交易。Hermit所支持代幣與WETH的兌換比率由第三方智能合約決定。
    21.ETH：指以太幣，是與以太坊區塊鏈相關的加密數字代幣，為避免疑問，其不包括「以太坊經典」。
    22. Hermit開源代碼（「Hermit OSC」）：指我們公開宣布開源的部分Hermit軟件代碼，允許開發者用戶在遵循相關開源協議及我們通知的規定下使用（包括二次開發）該部分開源代碼。
    23.開源協議：指開發者用戶使用Hermit開源代碼所應遵循的第三方開源協議。
    24.第三方服務：指第三方DApp、第三方智能合約、第三方開源協議、第三方硬件錢包、第三方網頁、第三方交易所等第三方提供的產品和服務。
    三、Hermit服務（統稱「服務」）
    1.創建和恢復身份。您可以使用Hermit提供的「創建身份」、「恢復身份」按鍵進行身份的創建和恢復，並能在一個身份下，同時管理多鏈錢包。
    2.導入錢包。對Hermit支持的數字代幣，您可以使用Hermit生成新錢包或導入相關區塊鏈系統的其它錢包工具生成的兼容錢包。
    3.轉賬、收款。您可以使用Hermit的轉賬、收款功能進行數字代幣的管理，即運用私鑰進行電子簽名，對相關區塊鏈的賬本進行修改。轉賬是指付款方利用收款方的ENS域名或區塊鏈地址進行轉賬操作，該「轉賬」行為涉及在相關區塊鏈系統的分布式賬本中對該交易的有效記錄（而非在Hermit上實際交付或轉讓數字代幣）。
    4.行情查看。您可以使用Hermit查看第三方提供的數字代幣匯率價格。Hermit通過抓取相應的數字代幣匯率信息並展示在Hermit中的「市場」版塊。
    5.管理數字代幣。您可以從Hermit操作界面添加、保管或移除Hermit所支持的數字代幣（ETH、BTC除外）。
    6.幣幣兌換（DEX）。您可以與使用第三方Hermit智能合約的第三方進行數字代幣兌換，由Hermit作為界面工具幫助您和第三方智能合約交互並顯示該數字代幣兌換的相應結果。
    7.瀏覽DApp。您通過Hermit訪問並使用該DApp（包括我們自己的DApp和第三方DApp）提供的服務。
    8.搜索DApp。您通過Hermit的搜索框，可以對已在Hermit羅列的DApp進行搜索。
    9.集成硬件錢包。您可以使用合適版本的Hermit與特定的硬件錢包進行匹配，並利用硬件錢包確認通過Hermit所進行的交易。
    10.免密支付。您可以使用Hermit中的免密支付功能，免密支付將用戶錢包密碼通過安全加密算法存儲至您的手機設備的Keychain/Keystore中，交易時調用您的生物識別（指紋或面容）鑒權，快速完成支付與簽名。
    11.開發者模式。為方便開發者用戶，在開發者模式下開發者用戶可以通過搜索框鍵入URL而訪問任何其他網站和未在Hermit集成的第三方DApp。
    12.交易記錄。我們將通過區塊鏈系統拷貝您全部或部分的交易記錄。但您應以區塊鏈系統的最新交易記錄為準。
    13.暫停服務。您知悉，基於區塊鏈系統交易「不可撤銷」的屬性，我們不能為您撤回或撤銷交易操作，但在一定情況下，我們可以暫停或者限製某位用戶對Hermit軟件的操作。
    14.其他我們認為有必要提供的服務。
    用戶使用Hermit時了解並接受：
    1.秉承著區塊鏈的去中心化特點，並為了保護您數字代幣安全，我們提供的是去中心化服務，大大區別於銀行業金融機構。您了解並接受，我們不承擔以下責任：
    （1）存儲您的錢包密碼（即您創建/導入錢包時設置的密碼）、私鑰、助記詞或Keystore；
    （2）找回您的錢包密碼、私鑰、助記詞或Keystore；
    （3）凍結錢包；
    （4）掛失錢包；
    （5）恢復錢包；或
    （6）交易回滾。
    2.您應當自行承擔保管含有Hermit的移動設備、備份Hermit、備份錢包密碼、助記詞、私鑰及Keystore的責任。如您遺失移動設備、刪除且未備份Hermit、刪除且未備份錢包、錢包被盜或遺忘錢包密碼、私鑰、助記詞或Keystore，我們均無法還原錢包或找回錢包密碼、私鑰、助記詞或Keystore；如用戶進行交易時誤操作（例如輸錯轉賬地址、輸錯兌換數額），我們無法取消交易，且我們亦不應對此承擔任何責任。
    3.如您使用Hermit的免密支付功能，請您妥善備份錢包密碼。當您的指紋或面容識別多次驗證失敗之後，您將需要輸入自己的錢包密碼。如果您遺忘錢包密碼的，您需要通過導入助記詞/私鑰的方式，設置新的錢包密碼。我們不存儲您的指紋、面容識別等生物信息，且我們亦不應對此承擔任何責任。
    4. Hermit所能夠提供的數字代幣管理服務並未包括所有已存在的數字代幣，請勿通過Hermit操作任何Hermit不支持的數字代幣。
    5. Hermit上集成的DApp包括我們自主擁有的DApp和第三方平臺提供的DApp。對於第三方平臺提供的DApp，Hermit僅為用戶進入DApp提供搜索和區塊鏈瀏覽器功能，不對第三方DApp的功能或服務質量提供任何擔保。您在第三方DApp上接受服務或進行交易前應自行判斷和評估該第三方DApp提供的服務或交易是否存在風險。
    6. Hermit上提供的幣幣兌換功能的實質是您使用第三方智能合約在區塊鏈系統上進行的數字代幣兌換。對於第三方智能合約提供的服務，Hermit僅為您提供與第三方智能合約交互的工具，不對第三方智能合約的功能或服務質量提供任何擔保。您在該第三方智能合約上接受服務或進行交易前應自行判斷和評估該第三方智能合約提供的服務或交易是否存在風險。我們強烈建議您閱讀相關智能合約的不斷更新的用戶協議和/或免責聲明。我們保留出於任何原因立即終止或暫停訪問這些第三方服務的權利，恕不另行通知或承擔責任。
    7. Hermit上集成的硬件錢包由第三方提供，Hermit不對第三方硬件錢包的功能或服務質量提供任何擔保，且Hermit不保證實現與任何種類和版本的硬件錢包之間的匹配功能（具體請以我們不時作出的通知為準）。用戶在使用第三方硬件錢包之前應自行判斷和評估該硬件錢包是否存在風險。您應仔細閱讀並同意相關硬件錢包的不斷更新的使用許可協議等文件。
    8.您在Hermit上使用開發者模式通過輸入URL訪問其他網站或未在Hermit集成的第三方DApps的，您知悉並同意您了解URL鏈接的網站和第三方DApps可能存在的安全隱患，並獨立承擔所有的風險和後果。
    四、您的權利義務
    （一）創建或導入錢包
    1.創建或導入錢包。您有權在您的移動設備上通過Hermit創建和/或導入錢包，有權設定錢包的錢包密碼等信息，並有權通過Hermit應用程序，使用自己的錢包在區塊鏈上進行轉賬和收款等交易。
    2.身份驗證。按照有關法律法規的要求，特定用戶在使用Hermit提供的有關服務時，應當按照Hermit的提示及時完成相關身份驗證，要求您提交包括但不限於您的姓名、身份證號碼、手機號碼、銀行卡號信息等個人信息。否則該特定用戶將無法使用有關服務，因特定用戶拖延造成的損失由您自行承擔。
    3.我們可能為不同的終端設備開發不同的軟件版本，您應當根據實際需要選擇下載合適的版本進行安裝。如果您從未經合法授權的第三方獲取本軟件或與本軟件名稱相同的安裝程序，我們將無法保證該軟件能否正常使用，也無法保證其安全性，因此造成的損失由您自行承擔。
    4.本軟件新版本發布後，舊版軟件可能無法使用。我們不保證舊版軟件的安全性、繼續可用性及提供相應的客戶服務。請您隨時核對並下載最新版本。
    （二）使用Hermit
    1.您應自行承擔妥善保管移動設備、錢包密碼、私鑰、助記詞和Keystore等信息的責任。我們不負責為您保管以上信息。因您遺失移動設備或硬件錢包、主動或被動泄露、遺忘錢包密碼、私鑰、助記詞、Keystore或遭受他人攻擊、詐騙等所引起的一切風險、責任、損失、費用應由您自行承擔。
    2. Hermit信息提示。您了解並同意遵循我們在Hermit上發布的信息提示，按照信息提示的內容進行操作，否則，由此引起的一切風險、責任、損失、費用等應由您自行承擔。
    3.您知悉並理解Hermit沒有義務對第三方服務履行盡職調查義務，您應當謹慎評估並承擔所有與使用Hermit有關的風險。
    4.提供信息和文件。如果我們自行認為有必要獲取用戶的相關信息以遵循任何與使用或操作Hermit相關的適用法律或法規的規定，您應按照我們的要求及時向我們提供該等信息，且您了解並接受，我們可以限製、暫停或終止您使用Hermit直到您提供滿足我們要求的信息。您承諾及時向我們告知任何有關其依據本《服務協議》向我們提供的文件和信息中的任何變化，且在沒有通知任何變化的書面通知的情形下，我們有權認為由您提供的文件和信息的內容是真實、正確、沒有誤導信息且沒有發生改變的。
    5.完成身份驗證。當我們合理認為您的交易行為或交易情況出現異常的，或認為您的身份信息存在疑點的，或我們認為應核對您身份證件或其他必要文件的情形時，請您積極配合我們核對您的有效身份證件或其他必要文件，及時完成相關的身份驗證。
    6.轉賬。
    （1）您知悉對於Hermit服務中您可使用的日計轉賬限額和筆數，可能因為您使用該轉賬服務時所處的國家/地區、監管要求、轉賬目的、Hermit風險控製、身份驗證等事由而不同。
    （2）您理解基於區塊鏈操作的「不可撤銷」屬性，當您使用Hermit轉賬功能時，您應當自行承擔因您操作失誤而導致的後果（包括但不限於因您輸錯轉賬地址、您自身選擇轉賬節點服務器的問題）。
    （3）您知悉在使用Hermit服務時，以下情況的出現可能導致轉賬功能不可用、轉賬「交易失敗」或「打包超時」：
    a)錢包余額不足；
    b)交易礦工費不足；
    c)區塊鏈執行智能合約代碼失敗；
    d)超出監管部門、Hermit或法律法規規定的付款額度；
    e)網絡、設備等技術故障；
    f)區塊鏈網絡擁堵、故障等原因引起交易被拋棄；
    g)您的地址或交易對方地址被識別為特殊地址，如高風險地址。
    （4）您知悉Hermit僅向您提供轉賬工具，在您使用Hermit完成轉賬後，我們即完成了當次服務的所有義務，我們對其他相關糾紛爭議，不承擔任何責任。
    7.幣幣兌換。您知悉，幣幣兌換的每日限額目前由第三方智能合約限定。我們亦可能對您每日可幣幣兌換的額度進行限製並不時調整。
    8.合法合規。您知悉在Hermit進行操作時或利用Hermit上的DApp、智能合約進行交易時，您應當遵循有關法律法規、國家政策的要求。
    9.公告通知。Hermit會以網站公告、消息中心信息、彈窗提示或客戶端通知等方式向您發送通知，例如通知您交易進展情況，或者提示您進行相關操作，請您及時予以關註。
    10.服務費用與納稅義務：
    （1）您使用Hermit的幣幣兌換服務時，第三方智能合約會向您收取手續費和/或服務費，具體費用以第三方智能合約收取數額為準，Hermit信息提示僅供參考；
    （2）我們暫時不向您收取任何形式的服務費或手續費，將來需對某些服務進行收費時我們將另行約定或公布規則；
    （3）您使用Hermit進行轉賬時應支付「礦工費」或網絡費，金額由您自行決定，並由相關區塊鏈網絡收取；
    （4）您知悉，在特定情況（包括但不限於您在轉賬期間為轉賬支付的「礦工費」或網絡費不足，或相關區塊鏈網絡不穩定）下，您的轉賬操作可能失敗；在該等情況下，即便您的轉賬操作未完成，您亦會被相關區塊鏈網絡收取礦工費；
    （5）您因在Hermit進行交易而發生的所有應納稅負及其它方面的費用均由您負責支付。
    （三）開發者用戶基於Hermit開源代碼的開發
    1.開發者用戶有權使用我們在官方渠道公布的Hermit開源代碼進行應用程序的二次開發，並下載和使用我們針對Hermit開源代碼發布的任何補丁或漏洞解決方案。
    2.在使用Hermit開源代碼時，開發者用戶知悉並同意：
    （1）如開發者用戶在使用Hermit開源代碼過程中發現任何漏洞、缺陷或軟件改進方案的，應及時聯系並告知我們，同時停止任何具有危害性的使用行為（如適用）；
    （2）Hermit開源代碼中可能包含第三方開源協議和源代碼，我們不對該等第三方開源協議和源代碼的功能、無病毒危害、無漏洞等提供任何形式的擔保。開發者用戶在使用Hermit開源代碼時應自行判斷和評估使用後果。開發者用戶應仔細閱讀並遵循相關開源軟件協議（及我們不時作出的通知的要求。
    五、風險提示
    1.您了解並知悉，由於數字代幣領域的法律法規政策尚未健全，該領域的數字代幣可能會產生無法兌現、技術不穩定等重大風險。您也了解數字代幣的價格波動幅度遠高於其他金融資產。我們謹慎提醒您應當根據自身財務狀況和風險偏好，以合理的方式選擇持有或處置任何一種數字代幣。您也了解Hermit提供的行情查看功能僅系抓取部分交易所的數字代幣匯率信息的搜索結果，並不表示為最新行情或最佳報價。
    2.在使用Hermit服務時，若您或您的相對方未遵從本《服務協議》或相關網站說明、交易、支付頁面中之操作提示、規則，我們並不保證交易會順利完成，且我們不承擔損害賠償責任。若發生前述情形，而款項已先行入賬您的或您的交易方的Hermit錢包或第三方錢包，您理解區塊鏈操作具有的「不可逆」屬性，以及相關交易具有「不可撤銷」的特征，由您及您的相對方自行承擔相應的風險後果。
    3.您理解並知悉，幣幣兌換交易均在第三方智能合約上發生、進行並完成。Hermit僅作為界面工具幫助您和第三方智能合約交互並顯示該已完成交易的相應結果。
    4.在您通過Hermit使用第三方服務時，我們強烈建議您仔細閱讀該等第三方服務的服務協議、隱私政策和其他相關的文件和信息等，了解交易對象及產品信息，謹慎評估風險後再在該第三方上進行交易。您理解該交易和有約束力的合同關系在您和您的相對方之間建立，與我們無關。我們對因您的交易行為所引起的一切風險、責任、損失、費用不承擔任何責任。
    5.當您將數字代幣轉給其他錢包地址時，您在交易過程中應當自行判斷對方是否為完全民事行為能力人並自行決定是否與對方進行交易或轉賬給對方等。
    6.在轉賬過程中，如果出現「交易失敗」、「打包超時」等類似的異常信息提示時，您應通過相關區塊鏈系統的官方途徑或其他的區塊鏈查詢工具進行再次確認，以避免重復轉賬；否則，由此所引起的一切損失和費用應由您自行承擔。
    7.您理解當您在Hermit上創建或導入錢包之後，您的Keystore、私鑰、助記詞等信息僅存儲在當前的這臺移動設備中，不存儲在Hermit或我們的服務器上。您可以按照Hermit提供的操作指南采取同步錢包等方式更換移動設備。但若您未保存或備份錢包密碼、私鑰、助記詞、Keystore等信息且在您移動設備丟失的情況下，您的數字代幣將因此丟失，我們無法為您找回。若您在導出、保存或備份錢包密碼、私鑰、助記詞、Keystore等信息的時候泄密，或保存或備份上述信息的設備或服務器被黑客攻擊或控製等情況下，您的數字代幣將因此丟失，我們無法為您找回。因前述情形產生的任何及所有損失應由您自行承擔。
    8.我們建議您在創建或導入錢包時對您錢包的錢包密碼、私鑰、助記詞及Keystore等信息做好安全備份。我們提請您註意，請不要采用以下電子備份方式：截圖、郵件、手機中的記事本應用、短信、微信、QQ等電子備份方式。我們建議您在紙質記事本上抄寫助記詞和Keystore等信息，同時您亦可將電子數據保管至密碼管理器。
    9.我們建議您在選購硬件錢包時應：
    （1）確認您購買的硬件錢包是否與Hermit版本相匹配；
    （2）從官方渠道選購全新的硬件錢包。
    10.我們善意提醒您謹慎使用Hermit的免密支付功能，建議您在使用前應：
    （1）仔細了解您手機設備生物識別的安全等級；
    （2）請勿在公共手機中開啟免密支付功能；及
    （3）如果錢包中的數字資產較大，請勿開啟免密支付功能。
    11.我們建議您在安全的網絡環境中使用Hermit，確保您的移動設備沒有越獄或root， 以避免可能存在的安全隱患。
    12.請您在使用Hermit過程中，警惕詐騙行為。一旦發現任何可疑行為，我們鼓勵您第一時間告知我們。
    六、服務的變更、中斷、終止
    1.您了解並同意我們可以自行決定暫時提供部分服務功能，或於將來暫停部分服務功能或開通新的服務功能。當我們改變服務時，只要您仍然使用Hermit，表示您仍然同意本《服務協議》或者本《服務協議》修正後的條款。
    2.為了盡可能避免任何對Hermit的誤操作或數字代幣的任何安全風險，您應避免在不具備區塊鏈基礎知識的前提下使用Hermit。對不具備區塊鏈基礎知識的用戶，我們有權拒絕提供部分或全部的服務功能。
    3.您理解存在如下情形時，我們將暫停提供服務（或在發生如下情形時徹底終止服務）：
    （1）因設備、區塊鏈系統維修、升級、故障和通信中斷等技術原因而中斷Hermit的運營；
    （2）因臺風、地震、海嘯、洪水、停電、戰爭或恐怖襲擊等不可抗力因素，電腦病毒、木馬、黑客攻擊、系統不穩定或政府行為等原因，造成我們不能提供服務或我們合理認為繼續提供服務會有較大風險的；
    （3）適用法律或政策發生重大不利變化的；或
    （4）發生我們無法控製或合理預見的其他情形。
    4.當用戶出現如下情況時，我們可單方面中止或終止您使用Hermit的部分或全部功能:
    （1）用戶死亡；
    （2）盜用他人的錢包信息或移動設備；
    （3）在Hermit填寫虛假個人信息；
    （4）拒絕Hermit的強製更新操作；
    （5）違反第三方開源協議或我們通知的規定使用Hermit開源代碼；
    （6）將Hermit用於違法或犯罪活動；
    （7）妨礙其他用戶正常使用Hermit；
    （8）偽稱我們的工作人員或管理人員；
    （9）攻擊、侵入、更改或以任何其他方式威脅我們計算機系統的正常運作；
    （10）利用Hermit宣傳垃圾廣告；
    （11）散布謠言，損害我們和Hermit商譽；或
    （12）違法行為，其他違反本《服務協議》的行為，及我們合理認為應當暫停功能的情形。
    5.如果我們變更、中斷、終止服務時，您有權在合理時間內導出您錢包等信息。
    七、您的陳述與保證
    1.您應遵守您所居住的國家或地區的法律法規，不得將Hermit用於任何非法目的，也不得以任何非法方式使用Hermit。
    2.您不屬於無資格使用Hermit服務的被排除人士。
    3.您不得利用Hermit從事任何違法或犯罪的行為，包括但不限於：
    （1）危害您所居住的國家或地區的國家安全、泄漏國家秘密、顛覆國家政權、破壞國家統一；
    （2）從事任何違法犯罪行為，包括但不限於洗錢、非法集資等；
    （3）通過使用任何自動化程序、軟件、引擎、網絡爬蟲、網頁分析工具、數據挖掘工具或類似工具等，接入我們的服務、收集或處理我們所提供的內容，幹預或試圖幹預任何用戶；
    （4）提供賭博資訊或以任何方式引誘他人參與賭博；
    （5）侵入他人Hermit錢包盜取數字代幣；
    （6）進行與交易對方宣稱的交易內容不符的交易，或不真實的交易；
    （7）從事任何侵害或可能侵害Hermit服務系統、數據的行為；
    （8）其他我們有正當理由認為不適當的行為。
    4.您理解並同意，您將對您違反有關法律（包括但不限於海關及/或稅務方面的監管規定）或者本《服務協議》之規定的行為負責，並應對因此類違反、違約、違法而使我們遭受任何的損失、第三方索賠或行政處罰進行賠償，包括合理的法律和行政成本、費用和支出，以及合理的律師費用。
    5.您承諾按時繳納我們的服務費用（如有），否則我們有權暫停對您提供的服務。
    八、隱私政策
    1.您提供給我們的任何數據或信息亦受我們隱私政策（「《Hermit隱私政策》」的約束，該隱私政策亦是本《服務協議》的一部分。
    九、免責及責任限製
    1.我們僅對本《服務協議》中所列明的義務承擔責任。
    2.您理解和同意，在法律所允許的最大範圍內，我們只能按照現有的技術水平和條件提供Hermit服務。因下列任何原因導致Hermit無法正常提供服務，我們不承擔責任：
    （1）Hermit系統停機維護或升級；
    （2）因臺風、地震、洪水、雷電或恐怖襲擊等不可抗力原因；
    （3）您的移動設備軟硬件和通信線路、供電線路出現故障的；
    （4）您操作不當或未通過我們授權或認可的方式使用我們服務的；
    （5）因電腦病毒、木馬、惡意程序攻擊、網絡擁堵、系統不穩定、系統或設備故障、通訊故障、電力故障、銀行或政府行為等原因；
    （6）非因我們的原因而引起的任何其它原因。
    3.我們對以下任何情形均不承擔責任：
    （1）因您遺失移動設備、刪除且未備份Hermit、刪除且未備份錢包、遺忘且未備份錢包密碼、私鑰、助記詞、Keystore而導致該用戶的數字代幣丟失；
    （2）因您自行泄露錢包密碼、私鑰、助記詞、Keystore，或借用、轉讓或授權他人使用自己的移動設備或Hermit錢包，或未通過我們官方渠道下載Hermit應用程序或以其他不安全的方式使用Hermit應用程序導致的您的數字代幣丟失；
    （3）因您誤操作（包括但不限於您輸錯轉賬地址、您自身選擇轉賬節點服務器的問題）Hermit導致的數字代幣丟失；
    （4）因您不理解區塊鏈技術的知識而進行誤操作導致的您的數字代幣丟失；
    （5）因系統滯後、區塊鏈系統不穩定等原因導致我們拷貝用戶在區塊鏈上的交易記錄發生偏差；
    4.您應承擔由下列情形產生或與之相關的風險和後果：
    （1）您使用第三方服務操作的交易；
    （2）您使用開發者模式；
    （3）您使用幣幣兌換服務，該等風險和後果應由您、交易相對方和相關智能合約發行方承擔。
    5.您理解Hermit僅作為您數字代幣管理的工具。我們不能控製第三方服務的質量、安全或合法性，信息的真實性或準確性，以及相對方履行其在與您簽訂的協議項下的各項義務的能力。您自行決定是否使用第三方服務。您理解該交易和有約束力的合同關系在您和您的相對方之間建立，與我們無關。我們提醒您在使用第三方服務前，應謹慎判斷第三方服務所提供相關信息的真實性、合法性和有效性。此外，您與任何第三方交易所產生的全部風險亦應由您自行承擔。
    6.您知悉Hermit可能同時為您及您的交易對手方提供服務或與之有關聯關系或其他利益相關的關系，您同意對我們可能存在的該等行為予以明確豁免任何實際或潛在的利益沖突，並不得以此來主張我們在提供服務時存在法律上的瑕疵，也不因此而加重我們的責任或註意義務。
    7.我們不提供以下形式的保證：
    （1）我們提供的服務將符合您的全部需求；
    （2）您經由我們的服務取得的任何技術、產品、服務、資訊或其他材料將符合您的期望；
    （3）我們從第三方交易所抓取的數字代幣市場交易行情等信息的及時性、準確性、完整性、可靠性；
    （4）您在Hermit上的交易對方會及時履行其在與您達成的交易協議中的各項義務。
    8.在任何情況下，我們對本《服務協議》所承擔的違約賠償責任總額不超過1）0.1個以太幣的市場價值；或2）新加坡元100元，以較高的為準。
    9.您理解Hermit僅作為您管理數字代幣、顯示交易信息的工具，我們不提供法律、稅務或投資建議等服務。您應當自行向法律、稅務、投資方面的專業人士尋求建議，且您在使用我們服務過程中所遭受的投資損失、數據損失等，我們概不負責。
    10.您理解根據適用法律法規的要求，我們可能不時更改我們的用戶準入標準，限定向特定用戶等提供服務的範圍和方式等。
    十、其他條款
    1.不得轉讓。在符合本《服務協議》條款的情況下，只有您（而非其他人）有權向我們主張與使用服務相關的索賠。您不得轉讓、交易，或試圖轉讓、交易您對該索賠的權利。任何該等轉讓行為均為無效，且我們對受讓方不承擔任何義務或責任。
    2.知識產權。Hermit系我們開發並擁有知識產權的應用程序。Hermit中顯示的任何內容（包括本《服務協議》、公告、文章、視頻、音頻、圖片、檔案、資訊、資料、商標或標識）的知識產權歸我們或第三方權利人所有。您僅可為持有和管理數字代幣之目的使用Hermit應用程序及其中的內容。未經我們或第三方權利人的事先書面同意（或相關開源協議的允許），任何人不得擅自使用、修改、反向編譯、復製、公開傳播、改變、散布、發行或公開發表上述應用程序及內容（包括Hermit開源代碼）。本《服務協議》不應被視為授予您任何知識產權，包括出於任何目的使用與我們或服務相關的任何信息、圖片、用戶界面、標識、商標、商業名稱、網絡域名或版權的權利。
    3.非棄權。任何我們未執行本《服務協議》或未向您主張我們在本《服務協議》項下的權利、索賠或訴因的行為均不被視為放棄我們向您主張任何權利、索賠或訴因的權利。
    4.完整協議：
    （1）本《服務協議》由《Hermit服務協議》、《Hermit隱私政策》及我們不時公布的各項規則（包括「幫助中心」的內容）組成。
    （2）除了本《服務協議》中的《Hermit服務協議》、《Hermit隱私政策》外，本《服務協議》包含我們之間關於使用Hermit和相關服務的全部協議和諒解，並取代所有先前的（口頭的和書面的）協議、諒解或安排。
    5.稅款：
    （1）使用本《服務協議》下的服務不含您在任何法域就您使用本服務所適用、產生、有關的稅款（「應納稅款」）。
    （2）您應負責確定任何應納稅款，並向合適的稅務機關申報、代扣、收集、報告和代繳正確的應納稅款。您應自行承擔因未完成或未履行您的任何與應納稅款相關的義務而產生的所有處罰、索賠、罰款、懲罰和其他責任。
    （3）我們不負責確定任何應納稅款，亦不負責向合適的稅務機關申報、代扣、收集、報告和代繳正確的應納稅款。
    6.法律適用。本《服務協議》適用新加坡共和國法律，並應據此解釋。
    7.管轄權。因本《服務協議》引起的或與之相關的任何爭議（包括任何有關其存在、有效性、終止的問題），雙方應首先尋求和解。如果該爭議在該和解程序開始後的三十(30)天內仍未解決，雙方應將該爭議提交至新加坡國際仲裁中心（簡稱「SIAC」），並通過遵循新加坡國際仲裁中心屆時有效的仲裁規則（該規則被視為通過引用並入本條款），最終以仲裁的方式在新加坡予以解決。仲裁庭由一名仲裁員組成，由SIAC主席任命。仲裁語言為英語。每一方不可撤銷地接受新加坡法院之非專屬管轄權，以支持和協助根據本段前述內容進行的仲裁程序，包括在該程序的結果作出之前給予臨時救濟（如必要）。
    8.《合同（第三方權利）法》。新加坡共和國的《合同（第三方權利）法》（第53B章）（可能不時被修改、修訂或補充）應適用於本《服務協議》。非本《服務協議》一方的人士不得擁有本《服務協議》項下的任何權利，也無權執行本《服務協議》。
    9.獨立性。本《服務協議》的任何部分被任何約束本《服務協議》的立法認為無效、非法或不可執行時，其僅在該範圍（且不得進一步擴展）內被視為無效、非法或不可執行。為避免疑問，本《服務協議》的剩余部分將繼續有效並保持充分的效力。
    10.部分無效。根據任何司法管轄區的法律，本《服務協議》任何條款被認定為非法、無效或不可執行的情形不得影響該條款依據其他司法管轄區的法律被認定為合法、有效或可執行，亦不得影響本《服務協議》其他條款的合法性、有效性或可執行性。
    11.本《服務協議》譯本。本《服務協議》的任何譯本（如有）僅為方便您而提供，無意對本《服務協議》的英文版本進行修改。如果本《服務協議》的英文版本與非英文版本之間存在沖突，應以英文版本為準。
    十一、其它
    1.您應當全面了解並遵守您所在司法轄區與使用服務所有相關法律、法規及規則。
    2.您在使用服務過程中，如遇到任何問題，您可以通過在Hermit提交反饋等方式聯系我們。
    3.所有的用戶可以在Hermit中查看本《服務協議》。我們鼓勵您在每次訪問Hermit時都查閱本《服務協議》。
    4.本《服務協議》未盡事宜，您需遵守我們不時更新的公告及相關規則。
    5.本《服務協議》自2022年9月3日起生效。
    
    本政策未盡事宜，您需遵守本站不時更新的公告及相關規則。`,
    text88: '12位助記詞導入',
    text89: '24位助記詞導入',
    text90: '助記詞長度不正確'
  },
  'EN': {
    text01: 'Create Wallet',
    text02: 'No Wallet',
    text03: 'Import Wallet',
    text04: 'Already have a wallet.',
    text05: 'I have read carefully and agree with《user agreement》',
    text06: 'Create Wallet',
    text07: 'Wallet Name',
    text08: 'Please input wallet name in1~10 characters',
    text09: 'Password',
    text10: 'Password is not less than 8 digits',
    text11: 'Repeat Password',
    text12: 'Create Wallet',
    text13: 'The two password is different，please try again',
    text14: 'backup memorizing words',
    text15: 'Security Tips',
    text16: 'Hermit wallet will not save your wallet mnemonics for you. Please back up and keep them yourself.To obtain mnemonics, you own assets. For security, please do not take screenshots or save mnemonics online.',
    text17: 'Backup wallet',
    text18: 'Please back up mnemonics in order to ensure that the backup is correct.',
    text19: 'Backup Completed',
    text20: 'Verify the mnemonic',
    text21: 'Please select the backup mnemonics in order.',
    text22: 'Confirm',
    text23: 'Error prompt: mnemonic error, please reconfirm!',
    text24: 'Wallet created successfully',
    text25: 'Mnemonic Words',
    text26: 'It consists of words separated by spaces.',
    text27: 'Private Key',
    text28: 'Public Key',
    text29: 'Keystore',
    text30: 'Encrypted private key JSON',
    text31: 'Mnemonic Import',
    text32: 'Mnemonic (filled apart)',
    text33: 'Enter mnemonic words separated by spaces',
    text34: 'Wallet Password',
    text35: 'Set a wallet password (not less than 8 digits)',
    text36: 'Repeat to confirm Wallet password',
    text37: 'Wallet Name',
    text38: 'Set Wallet Name',
    text39: 'Import',
    text40: 'Mnemonic error prompt: It is an invalid mnemonic, please check it!',
    text41: 'Mnemonic error prompt: mnemonic error, please check it!',
    text42: 'Incorrect password: The password is inconsistent, please enter it again!',
    text43: 'Success Tip: Imported successfully!',
    text44: 'Import private key ',
    text45: 'Wallet Password',
    text46: 'Set a wallet password (not less than 8 digits)',
    text47: 'Repeat to confirm Wallet password',
    text48: 'Wallet Name',
    text49: 'Set Wallet Name',
    text50: 'Private key error: Please enter a valid private key',
    text51: 'Incorrect password: The password is inconsistent, please enter it again!',
    text52: 'Success Tip: Imported successfully!',
    text53: 'Import Keystore',
    text54: 'Enter keystore file contents',
    text55: 'Wallet Password',
    text56: 'Enter the original corresponding wallet password of keystore',
    text57: 'please input wallet name',
    text58: 'Import',
    text59: 'Keysore error prompt: incorrect keysore content, please check!',
    text60: 'Wallet password error prompt: the original corresponding wallet password of keysore is wrong, please confirm!',
    text61: 'Success Tip: Imported successfully!',
    text62: 'Select import type',
    text63: 'Keystore can not be empty!',
    text64: 'Wallet password can not be empty',
    text65: 'Wallet name cannot be empty!',
    text66: 'Create your Wallet',
    text67: 'Protect your assets',
    text68: 'User agreement',
    text69: 'Acquiring mnemonic words is equivalent to owning the wallet assets',
    text70: 'Next',
    text71: 'Do not take screenshots.',
    text72: 'Enter the plaintext private key',
    text73: 'Please write the mnemonic down in order to ensure the backup is correct.',
    text74: 'Keep the mnemonic phrase in a safe place isolated from the network.',
    text75: 'Do not share and store mnemonic phrases in a networked environment, such as emails, photo albums, social applications, etc.',
    text76: 'Set wallet name',
    text77: 'The mnemonic is composed of English words, please copy and keep it properly.',
    text78: 'If the mnemonic is lost and cannot be retrieved, be sure to back up the mnemonic.',
    text79: 'Wallet password cannot be empty!',
    text80: 'Password is not less than 8 digits',
    text81: 'Private key cannot be empty!',
    text82: 'Import',
    text83: 'Enter the original corresponding fund password of Keystore',
    text84: 'The password input is inconsistent, please re-enter',
    text85: 'Wallet name cannot exceed 10 characters',
    text86: 'Wallet already exists, please do not import the same wallet',
    text87: `Hermit Matrix Network (hereinafter referred to as "me" or "us") is a geek development organization specializing in blockchain software, dedicated to providing trusted digital asset management services for individuals like you ("you" or "your") using decentralized technology. We host a top-level domain: https://www.hermit.network, which provides information about Hermit and our products, as well as sub-domain ("Website") information about our products, including text, images, audio, code and other materials or third-party information.<br>
As more and more scammers try to trick unsuspecting victims of digital assets, verify your SSL certificate every time you visit our domain name. Make sure the SSL certificate is authentic before downloading, clicking on, or otherwise interacting with it from the website you are visiting. For the avoidance of doubt, we have no control or liability over the content, privacy policy or conduct of any third party website or service. We shall not be liable or liable, directly or indirectly, for any damage or loss caused or claimed by the use of, or reliance on, any such content, goods or services on or through such websites or services.<br>
This Service Agreement ("Agreement" or "Service Agreement") contains the terms and conditions governing your access to and use of the Website and Services we provide (as defined below) and is an agreement between us and you or the entity you represent. Please read the Service Agreement carefully before using this site or service. By using the Site, or by clicking a button or check box to accept or agree to the Terms of Service (if any) of this Service Agreement, or by filling out a Service Order, or, if earlier, by using or otherwise accessing the Service (Effective Date), you (1) accept and agree to this Service Agreement and any additional terms, rules and conditions of participation that we may from time to time issue, and (2) agree to the collection, use, disclosure and other processing of information as described in our Privacy Policy. If you do not agree to this Service Agreement, you may not access or use the Services.<br>
In particular, we remind you to read this Service Agreement and other documents referred to in this Service Agreement carefully, in particular the Disclaimer and Limitation of Liability clause in this Service Agreement, before using our Hermit Mobile Application (hereinafter referred to as "Hermit" or "this Software", which Hermit can download from any mobile application platform, including but not limited to Google Play Store and Apple App Store), to ensure that you fully understand the terms of this Service Agreement and consider the risks of using Hermit.<br>
I. Confirmation and Acceptance of this Service Agreement<br>
1. You understand that this Service Agreement and related agreements apply to our proprietary and decentralized applications ("DApp") developed and owned by Hermit and Hermit (excluding DApp developed by third parties).<br>
2. By downloading the Hermit software and creating, restoring, or importing into your wallet, you shall be deemed to have fully read and accepted all the terms of this Service Agreement, which shall take effect immediately and be binding on both Parties. If you do not agree to the terms of this Service Agreement, you must immediately stop using Hermit. If you have downloaded Hermit, delete it now.<br>
3. In accessing or using Hermit, you agree to:<br>
(1) To be bound by the latest version of this Service Agreement (without change or modification);<br>
(2) Within your jurisdiction, you have attained the legal age for the use of Hermit and may assume binding legal or pecuniary obligations arising out of the use of Hermit;<br>
(3) You are not an excluded person (as defined below).<br>
4. This Service Agreement may be updated by us from time to time, and as soon as the amended Service Agreement is published on our website, it shall take effect automatically without further notice. If you do not accept the amended terms after we publish them, please discontinue Hermit immediately.<br>
5. Draw your attention to the fact that your use of Hermit after any such modification of this Terms of Service indicates your acceptance of these modified Terms of Service.<br>
II、 Definitions<br>
1. China means the People's Republic of China, including (1) Hong Kong Special Administrative Region, (2) Macao Special Administrative Region and (3) Taiwan Region.<br>
2. Hermit: A multi-currency digital wallet developed by us based on distributed accounting technology, including other tools developed to facilitate your use of the blockchain system.<br>
3. Excluded persons:<br>
(1) persons other than natural persons who have the legal and conscious capacity to enter into this Service Agreement; or<br>
(2) Persons prohibited, restricted, unauthorized or unentitled to use the Services (as defined in this Service Agreement) in any form or manner (in whole or in part) by virtue of this Service Agreement, laws, regulatory requirements or provisions applicable to the User's jurisdiction.<br>
(3) For the avoidance of doubt, residents residing in China and/or users residing in China are also included in the definition of "excluded persons".<br>
We do not provide services to the excluded. If you are excluded, please stop using our service immediately. If you continue to use our services, you acknowledge and agree that you will bear all corresponding liability in accordance with the applicable laws, regulations and provisions of the jurisdiction in which you reside, and that you will exempt us from any liability arising from such use by you, including but not limited to, damages, third party claims or administrative penalties, and reasonable legal and administrative costs, costs and expenses, including reasonable attorney's fees, arising from such violations, breaches, violations, and administrative penalties.
4. Identity: refers to the digital identification based on your public-private key pair.<br>
Beginner's Guide: Before you use Hermit (and during future use), we provide you with a Hermit Guide to help you understand the basics of blockchain.<br>
6. Creation or import of wallets: refers to the process of creating or importing wallets using Hermit after you have accepted this Service Agreement.<br>
7. Wallet Password: The password that you decide to use to encrypt and protect your private key during the creation of your Hermit Wallet. As a decentralized application, Hermit does not store wallet passwords on your mobile device or our servers. Once you lose or forget your wallet password, you need to reset it with a private key or mnemonic.<br>
8. Information prompt: the information prompt content involved in the operating interface of the Hermit software is recommended to be operated according to the relevant steps.<br>
9. Specific users refer to users who are required by laws, regulations and policies of Singapore and other countries to cooperate with us in performing the obligation of personal information disclosure.<br>
10. Developer user: refers to the user who uses Hermit open source code, developer mode and other services provided to developers in accordance with our notification and relevant open source agreements.<br>
11. Private key: It consists of 256 random characters and is the core of digital tokens owned and used by users.<br>
12. Public Key: The private key is generated by a one-way derivation based on cryptographic principles and used to generate the block chain digital wallet address, which is the public collection address.<br>
13. Mnemonics: 12 ordered words (or 15/18/21/24) generated by stochastic algorithms, conforming to blockchain BIP39 industry standards. Private key is easy to record the manifestation of the convenience of your backup custody.<br>
14. Keystore: is a private key or mnemonic saved as a file encrypted by your wallet password, stored only on your mobile device and not synchronized to our server.<br>
15. Digital tokens: refer to the types of digital tokens currently supported by Hermit, including but not limited to BTC, ETH, etc.<br>
16. Materials: refer to the materials such as articles in the sections of "browse" and "market" on Hermit, which are owned by a third party and shall not be reproduced without authorization. This information is for your reference only and does not constitute our guidance or advice on your transactions.<br>
17. Message center: An inbox where you can receive messages or notifications from us.<br>
18. Personal information refers to all kinds of information recorded by electronic or other means that can be used separately or in combination with other information to identify a user's personal identity, including but not limited to personal biometric information, email address, wallet address, mobile device information, operation records, transaction records, etc., but does not include a user's wallet password, private key, mnemonic, or Keystore.<br>
19. "Intelligent contract" refers to an intelligent contract based on Ethernet for the purpose of disseminating, validating or performing contracts in an information-based manner, including but not limited to the Tokenlon Intelligent contract mentioned later.<br>
20. WETH: refers to the tokenization of ether coins, because ether coins do not meet their own ERC20 standards, packaging for ether coins tokenization, to facilitate the direct trading of ether coins with other tokens. The exchange rate between tokens supported by Hermit and WETH is determined by a third-party smart contract.<br>
21. ETH: refers to Ether coins, which are encrypted digital tokens related to Ethereal block chains, excluding the "Ethereal Classic" for the avoidance of doubt.<br>
22. Hermit open source code ("Hermit OSC"): refers to the part of Hermit software code that we have publicly announced as open source, allowing developers to use (including secondary development) this part of open source code subject to the provisions of the relevant open source agreements and our notifications.<br>
23. Open source agreement: refers to the third-party Open source agreement that developers and users should follow when using Hermit open source code.<br>
24. Third-party services: refer to the products and services provided by third parties such as third-party DApp, third-party intelligent contracts, third-party open source agreements, third-party hardware wallets, third-party web pages, third-party exchanges, etc.<br>
III、 Hermit Services (collectively referred to as "Services")<br>
1. Creation and restoration of identity. You can create and restore identities using the "Create identity" and "Restore identity" buttons provided by Hermit, and manage multiple wallets under one identity.<br>
2. Import wallets. For Hermit -supported digital tokens, you can use Hermit to generate new wallets or compatible wallets from other wallet tools imported into the relevant blockchain system.<br>
3. Transfer and collection. You can use Hermit's transfer, collection functions for digital token management, that is, the use of private keys for electronic signature, the relevant block chain of books to modify. Transfer refers to that the payer uses the ENS domain name or blockchain address of the payee to make the transfer, which involves the effective recording of the transaction in the distributed books of the relevant blockchain system (rather than the actual delivery or transfer of digital tokens on Hermit).<br>
4. Market review. You can use Hermit to view the exchange rates of digital tokens provided by third parties. Hermit grabs information about the exchange rate of digital tokens and displays it in the “market” section of Hermit.<br>
5. Managing digital tokens. You can add, store, or remove Hermit -supported digital tokens (except ETH, BTC) from the Hermit interface.<br>
6. Currency exchange (DEX). You can exchange digital tokens with a third party using a third party Hermit smart contract. Hermit acts as an interface tool to help you interact with the third party smart contract and display the results of the digital tokens exchange.<br>
7. Browse DApp. You access and use the services provided by this DApp (including our own DApp and third-party DApp) through Hermit.<br>
8. Search for DApp. You can search the DApp listed in Hermit through Hermit's search box.<br>
9. Integrated hardware wallet. You can use the appropriate version of Hermit to match a particular hardware wallet and use the hardware wallet to confirm transactions made through Hermit.<br>
10. Exemption from secret payment. You can use the Secret Free Payment feature in Hermit to store user wallet passwords through a secure encryption algorithm in the Keychain/Keystore on your mobile device, and invoke your biometric (fingerprint or face) authentication during the transaction to quickly complete the payment and signature.<br>
11. Developer model. In developer mode, developers can type in URLs to access any other site and third party DApp not integrated with Hermit.<br>
12. Transaction records. We will copy all or part of your transactions through the blockchain system. However, you should base your transaction on the latest block chain system transactions.<br>
13. Suspension of services. You understand that, based on the "irrevocable" nature of blockchain transactions, we cannot revoke or undo transactions for you, but under certain circumstances we can suspend or restrict a user's access to Hermit software.<br>
14. Other services we deem necessary to provide.<br>
Understand and accept when users use Hermit:<br>
1. Adhering to the decentralized characteristics of blockchain, and in order to protect the security of your digital tokens, we provide decentralized services, which are significantly different from banking financial institutions. You understand and accept that we do not assume the following responsibilities:<br>
(1) Store your wallet password (that is, the password you set when you created/imported your wallet), private key, mnemonic or keystore;<br>
(2) Retrieve your wallet password, private key, mnemonic or keystore;<br>
(3) Freezing wallets;<br>
(4) Reporting the loss of wallet;<br>
(5) Recovering the wallet; or<br>
(6) Trading rollback.<br>
2. You are responsible for keeping the mobile device containing Hermit, backing up Hermit, backing up the wallet password, mnemonics, private key and Keystore. If you have lost your mobile device, deleted and failed to back up Hermit, deleted and failed to back up your wallet, stolen or forgotten your wallet password, private key, mnemonic, or keystore, we will not be able to recover your wallet or retrieve your wallet password, private key, mnemonic, or keystore; we will not be able to cancel the transaction if the user misbehaves in the transaction (such as inputting the wrong transfer address, inputting the wrong exchange amount), and we will not be held responsible for this.<br>
3. If you use Hermit's secret free payment function, please backup your wallet password properly. You will need to enter your wallet password after your fingerprint or face recognition failed multiple times. If you forget your wallet password, you need to set the new wallet password by importing the mnemonic/private key. We do not store your fingerprints, face recognition and other biological information, and we are not responsible for this.<br>
4. The digital token management services that Hermit can provide do not include all existing digital tokens, please do not operate any digital tokens that Hermit does not support through Hermit.<br>
5. DApp integration on Hermit includes our own DApp and DApp from third-party platforms. For DApp provided by third-party platforms, Hermit only provides search and blockchain browsers for users to access DApp, and does not provide any guarantee of third-party DApp functionality or quality of service. You should judge and evaluate the risks of the services or transactions provided by the third-party DApp before accepting the services or making transactions on the third-party DApp.<br>
6. The essence of the currency exchange function provided on Hermit is the exchange of digital coins on the blockchain system using third-party smart contracts. For services provided under third party smart contracts, Hermit only provides you with tools for interacting with third party smart contracts, and does not provide any guarantee for the function or quality of service of third party smart contracts. You shall, before accepting or transacting the service or transaction under the third party intelligent contract, judge and assess whether there is any risk in the service or transaction provided by the third party intelligent contract. We strongly recommend that you read the updated User Agreement and/or Disclaimer for the Smart Contract. We reserve the right to immediately terminate or suspend access to these third party services for any reason without notice or responsibility.<br>
7. Hardware wallets integrated on Hermit are provided by third parties, Hermit does not provide any warranty on the functionality or quality of service of third party Hardware wallets, and Hermit does not guarantee the implementation of matching functionality with any type or version of Hardware wallets (subject to our notice from time to time). Before using a third-party hardware wallet, the user should judge and evaluate whether the hardware wallet is at risk. You should carefully read and agree to relevant hardware wallet constantly updated license agreements and other documents.<br>
8. If you use the developer mode on Hermit to access other websites or a third party DApps not integrated on Hermit by entering a URL, you are aware of and agree that you understand the URL-linked website and the potential security risks of the third party DApps and bear all risks and consequences independently.
IV、 Your Rights and Obligations<br>
1. Create or import wallets<br>
1. Create or import wallets. You have the right to create and/or import wallets through Hermit on your mobile device, to set information such as the wallet password for the wallet, and to use your wallet to make transfers and receipts on the blockchain through the Hermit application.<br>
2. Authentication. Pursuant to the requirements of the relevant laws and regulations, when using the relevant services provided by Hermit, specific users shall promptly complete the relevant authentication in accordance with the prompts of Hermit, and be required to submit personal information such as your name, identity card number, mobile phone number, bank card number, etc. Otherwise, the specific user will not be able to use the services, due to specific user delays caused by the loss of your own.<br>
3. We may develop different versions of the software for different terminal devices, and you should download the appropriate version according to your actual needs. If you have never obtained this software or the installer with the same name as this software from a legally authorized third party, we will not be able to guarantee the normal use of this software, nor will we be able to guarantee its safety, so you will be responsible for the losses caused.<br>
4. After the new version of this software is released, the old version may not be used. We do not guarantee the security, continued availability or customer service of older software. Please check and download the latest version at any time.<br>
(II) Use of Hermit<br>
1. You shall be responsible for properly keeping the information such as mobile devices, wallet passwords, private keys, mnemonics and keystores. We are not responsible for keeping the above information for you. All risks, liabilities, losses and expenses arising from the loss of your mobile device or hardware wallet, active or passive disclosure, forgetting of your wallet password, private key, mnemonic, Keystore or being attacked or defrauded by others shall be borne by you.<br>
2. Hermit information prompt. You understand and agree to follow the information prompts we have published on Hermit and act on them, otherwise you will be responsible for all risks, liabilities, losses, expenses, etc.<br>
3. You are aware and understand that Hermit is not obligated to perform due diligence obligations with respect to third-party services and that you should carefully assess and assume all risks associated with the use of Hermit.<br>
4. Provision of information and documentation. If we deem it necessary to obtain information from the User in order to comply with any applicable laws or regulations relating to the use or operation of Hermit, you shall promptly provide us with such information in accordance with our requirements, and you understand and accept that, we may limit, suspend or terminate your use of Hermit until you provide information that meets our requirements. You undertake to promptly inform us of any changes in the documents and information provided by you to us in accordance with this Service Agreement, and without written notice of any changes, we have the right to consider the contents of the documents and information provided by you to be true, correct, unmisleading and unchanged.<br>
5. Complete the authentication. When we reasonably believe that there is an abnormality in your trading behavior or trading conditions, or that there is any doubt about your identity information, or we believe that it is necessary to check your identity certificate or other necessary documents, please actively cooperate with us in checking your valid identity certificate or other necessary documents, and complete the relevant identity verification in a timely manner.<br>
6. Transfer.<br>
(1) You are aware of the limit and number of daily transfers available to you in the Hermit service, which may vary depending on the country/region, regulatory requirements, purpose of the transfer, Hermit risk control, authentication, etc., in which you use the transfer service.<br>
(2) You understand the "irrevocable" nature of blockchain -based operations and that when you use the Hermit transfer function, you are responsible for the consequences of your mistakes (including but not limited to the problem of entering the wrong transfer address and choosing your own transfer node server).<br>
(3) You are aware that, when using Hermit Services, the following circumstances may result in unavailability of the transfer function, "transaction failure" or "packaging timeout":<br>
A) Insufficient wallet balance;<br>
B) Miners' fees for transactions are insufficient;<br>
C) Block chain failed to execute intelligent contract code;<br>
D) The amount of payment exceeds the amount prescribed by the regulatory authorities, Hermit or laws and regulations;<br>
E) Network, equipment and other technical failures;<br>
F) Trading is abandoned due to block chain network congestion, failure or other reasons;<br>
G) Your address or the address of the counterparty is identified as a special address, such as a high-risk address.<br>
(4) You are aware that Hermit only provides you with a transfer facility, and that after you have completed the transfer using Hermit, we have fulfilled all obligations of the current service and are not liable for any other disputes.<br>
7. Currency exchange. You are aware that the daily limit for currency exchange is currently set by a third party Smart Contract. We may also limit and adjust your daily currency limits from time to time.<br>
8. Legal compliance. You are aware that when operating at Hermit or trading with DApp, Smart Contracts on Hermit, you should comply with relevant laws, regulations, and national policies.<br>
9. Announcement. Hermit will notify you in the form of website announcements, message center information, pop-ups, or client notifications, for example, to inform you of the progress of your transactions, or to prompt you to take appropriate action. Please follow up.<br>
10. Service fees and tax payment obligations:<br>
(1) When you use Hermit's currency exchange service, the third party Smart Contract will charge you a service fee and/or service fee, the specific fee shall be the amount charged for the third party Smart Contract, and Hermit information tips are for reference only;<br>
(2) We do not charge you any form of service fee or handling fee for the time being, and we will otherwise agree or publish the rules when we need to charge for certain services in the future;<br>
(3) You shall pay "Miner's Fees" or Network Fees when using Hermit for transfer, the amount of which is at your discretion and collected by the relevant block chain network;<br>
(4) You are aware that your transfer operation may fail under certain circumstances (including but not limited to "miner's fees" or insufficient network fees paid for the transfer during your transfer, or the instability of the relevant blockchain network); in such circumstances, you may be charged by the relevant blockchain network for the miner's fees even if your transfer operation is not completed;<br>
(5) You are responsible for all taxable and other expenses incurred in connection with your transaction with Hermit.<br>
(III) Developer user development based on Hermit open source<br>
1. Developer users have the right to redevelop the application using the Hermit open source code we advertise in the official channel, and download and use any patches or vulnerability solutions we release for Hermit open source code.<br>
2. When using Hermit open source code, the developer user knows and agrees that:<br>
(1) If developer users find any bugs, defects or software improvement schemes in the process of using Hermit open source code, they shall contact and inform us in a timely manner, and stop any harmful use (if applicable);<br>
(2) Hermit open-source code may contain third-party open-source agreements and source code, and we do not provide any form of guarantee for the functions, virus-free, loop-free, etc., of such third-party open-source agreements and source code. Developers should judge and evaluate the consequences of using Hermit open source. Developer users should carefully read and follow the requirements of the relevant Open Source Software Agreements (and the notifications we give from time to time).<br>
V、 Risk Warning<br>
1. You are aware that, as the laws, regulations and policies in the field of digital tokens are not yet sound, the digital tokens in this field may cause major risks such as uncashable and unstable technologies. You also know that digital tokens are much more volatile than other financial assets. We caution that you should choose to hold or dispose of any digital token in a reasonable manner based on your financial position and risk preference. You also know that Hermit's Quotes View is only a search result for exchange rates for some exchanges, and does not represent the latest quotes or best offers.<br>
2. In using Hermit Services, we do not guarantee that the Fair will be successfully completed and we will not be liable for damages if you or your counterparties do not comply with the Notes, Notes, and Rules in this Service Agreement or the relevant Web Site Notes, Transactions, and Payment Pages. If any of the aforesaid circumstances occurs, and the money has been first credited to your Hermit Wallet or to a third party's Wallet, you understand that the blockchain operation has the attribute of "irreversibility" and the relevant transaction has the characteristic of "irrevocability", and you and your counterpart shall bear the corresponding risks and consequences on your own.<br>
3. You understand and are aware that currency exchange transactions take place, take place and are completed under third-party smart contracts. Hermit serves only as an interface tool to help you interact with third-party smart contracts and display the results of the completed transaction.<be>
4. When using third-party services through Hermit, we strongly recommend that you carefully read the service agreements, privacy policies and other relevant documents and information of such third-party services, understand the transaction objects and product information, and carefully assess the risks before trading on such third-party services. You understand that the transaction and the binding contractual relationship are established between you and your counterpart and are not ours. We are not liable for any risks, liabilities, losses or expenses arising from your trading.<br>
5. When you transfer your digital tokens to other wallet addresses, you shall, in the course of trading, determine on your own whether the other party is a person with full capacity for civil conduct and whether to trade with the other party or transfer the money to the other party.<br>
6. In the process of transfer of funds, if there are reminders of "transaction failure", "timeout of packing" or other similar abnormal information, you shall confirm again through the official channel of the relevant block chain system or other block chain query tools to avoid repeated transfer of funds; otherwise, you shall bear all losses and expenses arising therefrom.<br>
7. You understand that after you create or import a wallet on Hermit, your keystore, private key, mnemonic, and other information is stored only on the current mobile device and not on Hermit or our servers. Follow the instructions provided by Hermit to replace your mobile device with a synchronous wallet. However, if you do not save or back up your wallet password, private key, mnemonic, keystore, and other information and if your mobile device is lost, your digital tokens will be lost and we cannot retrieve them for you. If you divulge information such as your wallet password, private key, mnemonic, or keystore when you export, save, or back up your wallet password, private key, mnemonic, or if the device or server that saved or backed up that information is hacked or controlled, your digital tokens will be lost and we cannot retrieve them for you. Any and all losses arising from the foregoing shall be borne by you.<br>
8. We recommend that you make a secure backup of your wallet's password, private key, mnemonic and keystore information when you create or import your wallet. We call your attention, please do not use the following electronic backup methods: screenshots, mail, mobile phone notepad app, SMS, WeChat, QQ and other electronic backup methods. We recommend that you copy mnemonic and keystore information on your paper notepad, and that you also keep your electronic data in the password manager.
9. We recommend that you purchase your hardware wallet by:<br>
(1) Confirm whether the hardware wallet you purchased matches the Hermit version;<br>
(2) Purchasing new hardware wallets from official sources.<br>
10. We warn you in good faith to be careful about using Hermit's secret free payment feature and recommend that you:<br>
(1) Carefully understand the security level of biometric identification of your mobile phone equipment;<br>
(2) Please do not turn on the secret free payment function in public mobile phones; and<br>
(3) If the digital assets in the wallet are relatively large, please do not turn on the secret free payment function.<br>
11. We recommend that you use Hermit in a secure network environment to ensure that your mobile device is not jailbroken or rooted to avoid possible security risks.<br>
12. Please watch out for fraud when using Hermit. We encourage you to notify us of any suspicious activity as soon as possible.<br>
VI、 Alteration, Interruption and Termination of Services<br>
1. You understand and agree that we may, at our own discretion, temporarily provide some services or suspend some services or launch new services in the future. When we change the Services, as long as you still use Hermit, you still agree to this Service Agreement or the amended terms of this Service Agreement.<br>
2. To avoid, as far as possible, any mishandling of Hermit or any security risks to digital tokens, you should avoid using Hermit without a basic knowledge of blockchain. We have the right to withhold some or all of our services from users who do not have the basics of blockchain.<br>
3. You understand that under any of the following circumstances, we will suspend the provision of services (or completely terminate the services if:<br>
(1) interruption of Hermit operations due to technical reasons such as maintenance, upgrades, malfunctions and communication interruptions of equipment and blockchain systems;<br>
(2) Due to force majeure factors such as typhoon, earthquake, tsunami, flood, power outage, war or terrorist attack, etc., computer virus, Trojan horse, hacker attack, system instability or government behavior, etc., we cannot provide services or we reasonably believe that there will be great risks in continuing to provide services;<br>
(3) significant adverse changes in the applicable laws or policies; <br>
(4) Other circumstances beyond our control or reasonable forecast.<br>
4. We may unilaterally suspend or terminate your use of some or all of Hermit's features if:<br>
(1) The user dies;<br>
(2) embezzling others' wallet information or mobile devices;<br>
(3) Filling in false personal information at Hermit;<br>
(4) Refusing Hermit's mandatory update operation;<br>
(5) using Hermit open source code in violation of the provisions of the third party open source agreement or our notification;<br>
(6) Hermit is used for illegal or criminal purposes;<br>
(7) Hindering the normal use of Hermit by other users;<br>
(8) Pretending to be our staff or managers;<br>
(9) to attack, invade, modify or in any other way threaten the normal operation of our computer systems;<br>
(10) using Hermit to advertise junk;<br>
(11) Spreading rumors to the detriment of our and Hermit goodwill; or<br>
(12) Illegal acts, other acts in violation of this Service Agreement, and circumstances where we reasonably consider that the functions shall be suspended.<br>
5. You have the right to export your wallet and other information within a reasonable time if we change, interrupt or terminate the service.<br>
VII、 Your Statement and Warranty<br>
1. You shall abide by the laws and regulations of the country or region in which you reside and shall not use Hermit for any unlawful purposes or in any unlawful manner.<br>
2. You are not an excluded person who is not eligible to use Hermit Services.<br>
3. You shall not use Hermit for any illegal or criminal purpose, including but not limited to:<br>
(1) endanger the national security of the country or region where you live, divulge state secrets, subvert state power, or undermine national unity;<br>
(2) engaging in any illegal or criminal activities, including but not limited to money laundering and illegal fund-raising;<br>
(3) access to our services, collect or process our content, interfere with or attempt to interfere with any user by using any automated program, software, engine, web crawler, web analysis tool, data mining tool or similar tool;<br>
(4) Providing gambling information or inducing others to participate in gambling by any means;<br>
(5) Hacking into the wallet of Hermit to steal digital tokens;<br>
(6) Carrying out any transaction that is inconsistent with the transaction contents declared by the counterparty, or any transaction that is untrue;<br>
(7) engage in any act that infringes or may infringe upon the Hermit service system or data;<br>
(8) Other acts that we have justified reasons to consider inappropriate.<br>
4. You understand and agree that you will be liable for any breach of applicable laws (including, but not limited to, customs and/or tax regulations) or of this Service Agreement by you and will be liable for any damages, third party claims or administrative penalties suffered by us as a result of such violation, breach of contract, or breach, including reasonable legal and administrative costs, expenses and expenses, and reasonable attorney fees.<br>
5. You undertake to pay our service fees on time (if any), otherwise we have the right to suspend the services provided to you.<br>
VIII、 Privacy Policy<br>
1. Any data or information you provide to us is also governed by our Privacy Policy (Hermit Privacy Policy), which is also part of this Service Agreement.<br>
IX、 Disclaimer and Limitation of Liability<br>
1. We are only liable for the obligations set out in this Service Agreement.<br>
2. You understand and agree that to the maximum extent permitted by law, we can only provide Hermit services in accordance with existing technical standards and conditions. We are not responsible for any of the following reasons that prevent Hermit from providing services normally:<br>
(1) Downtime maintenance or upgrade of the Hermit system;<br>
(2) Due to typhoon, earthquake, flood, lightning, terrorist attack or other force majeure;<br>
(3) The software and hardware of your mobile equipment and the communication lines and power supply lines are faulty;<br>
(4) You use our services improperly or without our authorization or approval;<br>
(5) Due to computer virus, Trojan horse, malicious program attack, network congestion, system instability, system or equipment failure, communication failure, power failure, bank or government action, etc.;<br>
(6) any other cause not attributable to us.<br>
3. We are not liable under any of the following circumstances:<br>
(1) The user's digital tokens are lost due to your loss of the mobile device, deletion and non-backup of Hermit, deletion and non-backup of wallet, forgetting and non-backup of wallet passwords, private keys, mnemonics, and Keystore;<br>
(2) Your digital tokens are lost as a result of the disclosure by you of the wallet password, private key, mnemonic, keystore, or the borrowing, transfer or authorization of others to use your mobile device or Hermit wallet, or the failure to download the Hermit application through our official channels or otherwise use the Hermit application in an unsafe manner;<br>
(3) Loss of digital token caused by your misoperation (including but not limited to the problem that you input the wrong transfer address and you choose the transfer node server yourself);<br>
(4) Your digital tokens are lost due to misoperation due to your lack of knowledge of blockchain technology;<br>
(5) We copy the user's transaction records on the block chain due to system lag, instability of the block chain system or other reasons;<br>
4. You shall bear the risks and consequences arising from or related to:<br>
(1) Transactions in which you operate using third-party services;<br>
(2) You use the developer mode;<br>
(3) If you use currency exchange services, such risks and consequences shall be borne by you, the other party to the transaction and the issuer of the relevant intelligent contract.<br>
5. You understand that Hermit is only a tool for your digital token management. We have no control over the quality, safety or legality of third party services, the authenticity or accuracy of information, or the ability of counterparties to perform their obligations under agreements with you. You are free to use third-party services. You understand that the transaction and the binding contractual relationship are established between you and your counterpart and are not ours. We remind you to carefully judge the authenticity, legality and validity of the relevant information provided by third-party services before using the third-party services. In addition, you shall be responsible for all risks arising from your dealings with any third party.<br>
6. You acknowledge that Hermit may provide services to, or be associated with, or otherwise related to, you and your counterparty, and you agree to expressly waive any actual or potential conflict of interest with respect to any such conduct that we may have, and shall not assert any legal flaw in the provision of our services or aggravate our liability or duty of care.<br>
7. We do not provide the following forms of assurance:<br>
(1) The services we provide will meet all your needs;<br>
(2) Any technology, product, service, information or other material you acquire through our services will meet your expectations;<br>
(3) The timeliness, accuracy, completeness and reliability of the trading quotations and other information of the digital token market obtained by us from the third party's exchanges;<br>
(4) Your counterparty at Hermit will promptly fulfill its obligations under the transaction agreement with you.<br>
8. In no event shall we be liable for breach of this Service Agreement for more than 1) 0.1 ethernet market value; or 2) Singapore $100, whichever is higher.<br>
9. You understand that Hermit is solely your tool for managing digital tokens and displaying transaction information and that we do not provide legal, tax or investment advice services. You should seek advice from legal, tax and investment professionals on your own, and we will not be responsible for any loss of investment or data you incur while using our services.<br>
10. You understand that in accordance with the requirements of applicable laws and regulations, we may from time to time change our user access criteria to limit the scope and method of providing services to specific users.<br>
X、 Other Provisions
1. Not transferable. Subject to the terms of this Service Agreement, only you (and not others) are entitled to claim against us for claims relating to the use of the Service. You may not assign, trade, or attempt to assign, trade your rights to the claim. Any such assignment shall be null and void and we bear no obligation or responsibility to the Transferee.<br>
2. Intellectual property rights. Hermit is an application that we develop and own intellectual property. Intellectual property rights pertaining to any content displayed in Hermit (including this Service Agreement, Notices, Articles, Videos, Audio, Pictures, Files, Information, Materials, Trademarks or Logos) are owned by us or third party rights holders. You may use the Hermit application and its contents only for the purposes of holding and managing digital tokens. Without the prior written consent of us or the third party right holder (or the permission of the relevant open source agreement), no one may use, modify, decompile, copy, publicly disseminate, change, distribute, distribute or publicly publish the aforesaid application and content (including Hermit open source code). This Service Agreement shall not be deemed to confer on you any intellectual property rights including the right to use for any purpose any information, pictures, user interface, logos, trademarks, trade names, domain names or copyrights relating to us or the Services.<br>
3. Non-waiver. Any failure by us to enforce this Service Agreement or to claim our rights, claims or causes of action under this Service Agreement shall not be deemed a waiver of any of our rights, claims or causes of action against you.<br>
4. Full agreement:<br>
(1) This Service Agreement comprises the Hermit Service Agreement, the Hermit Privacy Policy and such rules as we may from time to time publish (including the contents of the Help Center).<br>
(2) In addition to the Hermit Service Agreement and the Hermit Privacy Policy in this Service Agreement, this Service Agreement encompasses all agreements and understandings between us regarding the use of Hermit and related services and supersedes all previous (oral and written) agreements, understandings or arrangements.<br>
5. Tax:<br>
(1) The use of services under this Service Agreement does not include any taxes ("taxes payable") that you apply, generate or relate to your use of the Services in any jurisdiction.<br>
(2) You shall be responsible for determining any amount of tax payable and for filing, withholding, collecting, reporting and withholding the correct amount of tax payable to the appropriate tax authorities. You shall be liable for all penalties, claims, fines, penalties and other liabilities arising from your failure to complete or comply with any of your tax obligations.<br>
(3) We are not responsible for determining any amount of tax payable and are not responsible for filing, withholding, collecting, reporting and withholding the correct amount of tax payable to the appropriate tax authorities.<br>
6. Application of law. This Service Agreement shall be governed by and construed in accordance with the laws of the Republic of Singapore.<br>
7. Jurisdiction. Any dispute arising out of or in connection with this Service Agreement (including any issue relating to its existence, validity or termination) shall first be settled between the Parties. If the dispute remains unresolved within 30 (30) days after the commencement of the conciliation proceedings, the parties shall submit the dispute to the Singapore International Arbitration Centre (hereinafter referred to as the "SIAC") and settle the dispute by arbitration in Singapore in accordance with the Arbitration Rules of the Singapore International Arbitration Centre then in force (which is deemed to have been incorporated into this Article by reference). The arbitral tribunal shall consist of one arbitrator appointed by the Chairman of SIAC. The language of arbitration shall be English. Each Party irrevocably accepts the non- exclusive jurisdiction of the courts of Singapore to support and facilitate arbitral proceedings under the foregoing provisions of this paragraph, including the granting of interim relief (if necessary) pending the outcome of such proceedings.<br>
8. Contract (Rights of Third Parties) Act. The Republic of Singapore's Contract (Rights of Third Parties) Act (Cap. 53B) (which may be amended, amended or supplemented from time to time) shall apply to this Service Agreement. A person who is not a party to this Service Agreement shall not have any rights under this Service Agreement nor shall he be entitled to enforce this Service Agreement.<br>
9. Independence. Where any part of this Service Agreement is deemed to be invalid, illegal or unenforceable by any legislation binding this Service Agreement, it shall be deemed to be invalid, illegal or unenforceable only within that scope (and without further extension). For the avoidance of doubt, the remainder of this Service Agreement shall remain in force and in full force and effect.<br>
10. Partially invalid. Any provision of this Service Agreement that is found to be unlawful, invalid or unenforceable under the law of any jurisdiction shall not affect the legality, validity or enforceability of such provision under the law of any other jurisdiction, nor shall it affect the legality, validity or enforceability of any other provision of this Service Agreement.<br>
11. This Service Agreement is translated. Any translation of this Service Agreement (if any) is provided solely for your convenience and is not intended to be amended in English. In case of any conflict between the English and non-English versions of this Service Agreement, the English version shall prevail.<br>
XI、 Others<br>
1. You shall fully understand and abide by all relevant laws, regulations and rules concerning the use of services in your jurisdiction.<br>
2. If you encounter any problems while using the service, you can contact us by submitting feedback at Hermit.<br>
3. This Service Agreement is available to all users in Hermit. We encourage you to consult this Service Agreement every time you visit Hermit.<br>
4. For matters not covered in this Service Agreement, you are subject to our bulletins and relevant rules as updated from time to time.<br>
5. This Service Agreement shall enter into force as of September 3, 2022.<br>
For matters not covered by this policy, you are required to abide by the bulletin and related rules updated from time to time.`,
    text88: '12 digit mnemonic import',
    text89: '24 digit mnemonic import',
    text90: 'The length of mnemonic words is incorrect'
  }
}
export default languages
